nvt/cooja-ng/src/arm/nrf54l15_soc.c
/*
 * nRF54L15 SoC — minimum-viable peripheral set.
 *
 * Models just enough to get past the Reset_Handler busy-wait in
 * nrfx_clock_start. Right now: GLOBAL_CLOCK at 0x5010_E000 only.
 * Subsequent commits add GRTC (Contiki tick source), UARTE20
 * (console), GPIO/GPIOTE, and eventually the 802.15.4 RADIO.
 *
 * Addresses come from the empirical trace in
 * devices/nrf54l15-dk/STATUS.md and the Contiki-NG nrf54l15 port
 * source — the Product Specification pages will be cross-referenced
 * as additional registers are modelled.
 *
 * NOTE: peripheral region is 0x50000000, NOT 0x40000000. That's the
 * single biggest map-level difference from nRF52.
 */
#include "nrf54l15_soc.h"
#include "arm_cpu.h"
#include "arm_nvic.h"
#include "ieee_802154.h"
#include "nrf_radio_common.h"
#include <stdio.h>
#include <stdlib.h>

/* sim_host shims — identical to nRF52's. Off-SoC chip drivers reach
 * the CPU's event scheduler through this vtable.  No external chips
 * are wired on either nrf54l15 board today, but the host fields must
 * still be valid for anything that touches plat->host. */
static int64_t nrf54l_host_now_ns(void *cpu) {
    return ((arm_cpu_t *)cpu)->sim_time_ns;
}
static void nrf54l_host_schedule_ns(void *cpu, cpu_event_t *ev, int64_t fire_ns) {
    arm_schedule_event_ns((arm_cpu_t *)cpu, ev, fire_ns);
}
static void nrf54l_host_cancel(void *cpu, cpu_event_t *ev) {
    arm_cancel_event((arm_cpu_t *)cpu, ev);
}

/* ============================================================
 * GLOBAL_CLOCK (0x5010_E000)
 *
 * Replaces the nRF52 CLOCK + POWER pair.  Offsets discovered
 * empirically by tracing the access pattern of nrfx_clock_start +
 * nrfx_clock_hfclk_start in the Contiki-NG nrf54l15 port:
 *
 *   write 1 → 0x440  (sub-block enable / clock domain config; ignored)
 *   read   ← 0x44C   (status; returns 0 — firmware accepts)
 *   read   ← 0x448   (status; returns 0 — firmware accepts)
 *   write 1 → 0x440  (re-poke after status check; ignored)
 *   write 0 → 0x108  (clear EVENTS_HFXOSTARTED)
 *   read   ← 0x108   (peek before kick)
 *   write 1 → 0x010  (TASKS_HFXOSTART — kick the crystal)
 *   loop:
 *     read 0x108     (EVENTS_HFXOSTARTED); if == 0 spin
 *
 * On real hardware the HFXO crystal takes ~700 µs to stabilise;
 * csim latches the event immediately on TASKS_HFXOSTART, same
 * shortcut we use for nRF52's HFCLK.  Sufficient for polling
 * firmware; IRQ-driven firmware also needs NVIC wiring (later).
 *
 * NOTE: offsets are NOT the canonical 0x000/0x100 Nordic uses on
 * nRF52 — nrf54l15 puts each task/event group inside a sub-block
 * with its own base offset.  Don't infer offsets from nRF52
 * register layouts; verify empirically before adding new ones.
 * ============================================================ */
#define NRF54L_GLOBAL_CLOCK_BASE          0x5010E000u
#define NRF54L_GLOBAL_CLOCK_SIZE          0x1000u

#define NRF54L_GC_TASKS_HFCLKSTART        0x000   /* nrf_802154 path */
#define NRF54L_GC_TASKS_LFCLKSTART        0x008   /* nrf_802154 path */
#define NRF54L_GC_TASKS_HFXOSTART         0x010   /* nrfx_clock_start path */
#define NRF54L_GC_EVENTS_HFCLKSTARTED     0x100
#define NRF54L_GC_EVENTS_LFCLKSTARTED     0x104
#define NRF54L_GC_EVENTS_HFXOSTARTED      0x108
#define NRF54L_GC_DOMAIN_ENABLE           0x440   /* WR 1 → bring clock domain up */
#define NRF54L_GC_DOMAIN_STATUS           0x44C   /* RD: bit 16 = domain running */

#define NRF54L_GC_DOMAIN_STATUS_RUNNING   (1u << 16)

static int nrf54l_global_clock_read(void *user_data, uint32_t addr) {
    nrf54l_global_clock_state_t *gc = (nrf54l_global_clock_state_t *)user_data;
    uint32_t off = addr - NRF54L_GLOBAL_CLOCK_BASE;
    switch (off) {
        case NRF54L_GC_EVENTS_HFCLKSTARTED:  return (int)gc->hfclkstarted;
        case NRF54L_GC_EVENTS_LFCLKSTARTED:  return (int)gc->lfclkstarted;
        case NRF54L_GC_EVENTS_HFXOSTARTED:   return (int)gc->hfxostarted;
        case NRF54L_GC_DOMAIN_STATUS:
            /* Bit 16 = "clock domain running".  clock_init's tight spin
             * (PC 0x152c..0x1534 in hello-world.nrf54l15-dk) polls this
             * via `lsls r3, #15; bpl` — i.e. waits for bit 16 to be set.
             * We return RUNNING once the domain has been enabled at
             * 0x440. Other status bits stay 0 until firmware needs
             * them. */
            return gc->domain_enable_440 ? (int)NRF54L_GC_DOMAIN_STATUS_RUNNING : 0;
        default:                             return 0;
    }
}

static void nrf54l_global_clock_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf54l_global_clock_state_t *gc = (nrf54l_global_clock_state_t *)user_data;
    uint32_t off = addr - NRF54L_GLOBAL_CLOCK_BASE;
    switch (off) {
        case NRF54L_GC_TASKS_HFCLKSTART:
            if (value == 1) gc->hfclkstarted = 1;
            break;
        case NRF54L_GC_TASKS_LFCLKSTART:
            if (value == 1) gc->lfclkstarted = 1;
            break;
        case NRF54L_GC_TASKS_HFXOSTART:
            if (value == 1) gc->hfxostarted = 1;
            break;
        case NRF54L_GC_EVENTS_HFCLKSTARTED:
            gc->hfclkstarted = value & 1;
            break;
        case NRF54L_GC_EVENTS_LFCLKSTARTED:
            gc->lfclkstarted = value & 1;
            break;
        case NRF54L_GC_EVENTS_HFXOSTARTED:
            gc->hfxostarted = value & 1;
            break;
        case NRF54L_GC_DOMAIN_ENABLE:
            /* Writing 1 brings the corresponding clock domain up; the
             * status bit at 0x44c becomes visible the next read. */
            gc->domain_enable_440 = value;
            break;
        default:
            /* Other offsets seen during init (e.g. 0x034 sub-enable,
             * 0x448 secondary status) are accepted as no-ops —
             * firmware reads but doesn't gate on them. */
            break;
    }
}

/* ============================================================
 * FICR (0x00FFC000) — INFO.DEVICEID is the only field firmware
 * reads on the boot path. linkaddr-arch.c combines it with the
 * Nordic OUI (f4:ce:36) to derive the link-layer EUI-64. The two
 * 32-bit DEVICEID words sit at offsets 0x304 / 0x308 (FICR.INFO
 * starts at 0x300, DEVICEID is at +4 inside INFO). Other FICR
 * fields read 0xFFFFFFFF on real HW (the reset value of unprogrammed
 * factory cells); we return the same so any code that gates on
 * "value != 0xFFFFFFFF" doesn't mistake silence for a programmed
 * value.
 * ============================================================ */
#define NRF54L_FICR_BASE                  0x00FFC000u
#define NRF54L_FICR_SIZE                  0x1000u
#define NRF54L_FICR_INFO_DEVICEID0        0x304
#define NRF54L_FICR_INFO_DEVICEID1        0x308

static int nrf54l_ficr_read(void *user_data, uint32_t addr) {
    nrf54l_ficr_state_t *ficr = (nrf54l_ficr_state_t *)user_data;
    uint32_t off = addr - NRF54L_FICR_BASE;
    switch (off) {
        case NRF54L_FICR_INFO_DEVICEID0: return (int)ficr->deviceid0;
        case NRF54L_FICR_INFO_DEVICEID1: return (int)ficr->deviceid1;
        default:                          return -1; /* 0xFFFFFFFF */
    }
}

static void nrf54l_ficr_write(void *user_data, uint32_t addr, uint32_t value) {
    /* FICR is read-only on real HW; the harness writes via the
     * struct directly, firmware never traps here. */
    (void)user_data; (void)addr; (void)value;
}

/* ============================================================
 * UARTE20 EasyDMA (0x500C_6000)
 *
 * Offsets confirmed from nrf54lv10a_enga_application.svd in
 * arch/cpu/nrf/lib/nrfx/mdk/ (Contiki-NG nrfx submodule).
 * ============================================================ */
#define NRF54L_UARTE20_BASE              0x500C6000u
#define NRF54L_UARTE20_SIZE              0x1000u

