nvt/cooja-ng/src/arm/nrf54l15_soc.c
#define NRF54L_UARTE_TASKS_DMA_TX_START  0x050
#define NRF54L_UARTE_TASKS_DMA_TX_STOP   0x054
#define NRF54L_UARTE_EVENTS_TXSTOPPED    0x130
#define NRF54L_UARTE_EVENTS_DMA_TX_END   0x168
#define NRF54L_UARTE_ENABLE              0x500
#define NRF54L_UARTE_DMA_TX_PTR          0x73C
#define NRF54L_UARTE_DMA_TX_MAXCNT       0x740
#define NRF54L_UARTE_DMA_TX_AMOUNT       0x744

static int nrf54l_uarte_read(void *user_data, uint32_t addr) {
    nrf54l_uarte_state_t *u = (nrf54l_uarte_state_t *)user_data;
    uint32_t off = addr - NRF54L_UARTE20_BASE;
    switch (off) {
        case NRF54L_UARTE_EVENTS_TXSTOPPED:   return (int)u->evt_txstopped;
        case NRF54L_UARTE_EVENTS_DMA_TX_END:  return (int)u->evt_dma_tx_end;
        case NRF54L_UARTE_ENABLE:             return (int)u->enable;
        case NRF54L_UARTE_DMA_TX_PTR:         return (int)u->tx_ptr;
        case NRF54L_UARTE_DMA_TX_MAXCNT:      return (int)u->tx_maxcnt;
        case NRF54L_UARTE_DMA_TX_AMOUNT:      return (int)u->tx_amount;
        default:                              return 0;
    }
}

static void nrf54l_uarte_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf54l_uarte_state_t *u = (nrf54l_uarte_state_t *)user_data;
    uint32_t off = addr - NRF54L_UARTE20_BASE;
    switch (off) {
        case NRF54L_UARTE_TASKS_DMA_TX_START:
            /* Kick TX: stream MAXCNT bytes from SRAM at PTR through the
             * console callback, then latch both EVENTS_DMA.TX.END and
             * EVENTS_TXSTOPPED.  Trigger on any bit-0 write; nrfx
             * sometimes writes non-1 values (e.g. flag bits via fp). */
            if ((value & 1) && u->plat) {
                for (uint32_t i = 0; i < u->tx_maxcnt; i++) {
                    uint8_t b = arm_read8(&u->plat->cpu, u->tx_ptr + i);
                    if (u->tx_cb) u->tx_cb(u->tx_user, b);
                }
                u->tx_amount = u->tx_maxcnt;
                u->evt_dma_tx_end = 1;
                u->evt_txstopped  = 1;
            }
            break;
        case NRF54L_UARTE_TASKS_DMA_TX_STOP:
            /* Defensive STOP after START.  Latch TXSTOPPED so a
             * stop-then-poll firmware path also escapes its loop. */
            if (value & 1) u->evt_txstopped = 1;
            break;
        case NRF54L_UARTE_EVENTS_TXSTOPPED:   u->evt_txstopped  = value & 1; break;
        case NRF54L_UARTE_EVENTS_DMA_TX_END:  u->evt_dma_tx_end = value & 1; break;
        case NRF54L_UARTE_ENABLE:             u->enable         = value;     break;
        case NRF54L_UARTE_DMA_TX_PTR:         u->tx_ptr         = value;     break;
        case NRF54L_UARTE_DMA_TX_MAXCNT:      u->tx_maxcnt      = value;     break;
        case NRF54L_UARTE_DMA_TX_AMOUNT:      u->tx_amount      = value;     break;
        default:
            /* Accept every other register write as a no-op: SHORTS,
             * BAUDRATE, CONFIG, FRAMETIMEOUT, PSEL.*, INTEN*,
             * PUBLISH_*, SUBSCRIBE_*, the RX-DMA cluster, etc.  None of
             * these have observed read-back semantics that would gate
             * boot progress in this firmware. */
            break;
    }
}

/* ============================================================
 * DPPI fabric — collapsed to one 32-channel global state
 * ============================================================ */
#define NRF54L_DPPI_CHEN          0x500
#define NRF54L_DPPI_CHENSET       0x504
#define NRF54L_DPPI_CHENCLR       0x508

/* All four DPPIC base addresses share the same state in our model.
 * Real HW has separate per-domain controllers; channel allocation in
 * Nordic's allocator keeps IDs unique across domains, so collapsing
 * them is safe for the firmware paths csim emulates. */
static const uint32_t nrf54l_dppic_bases[] = {
    0x50042000u,  /* DPPIC00 — paired with peripherals at 0x5004_xxxx */
    0x50082000u,  /* DPPIC10 — RADIO at 0x5008_A000 lives here */
    0x500C2000u,  /* DPPIC20 — UARTE20 at 0x500C_6000 lives here */
    0x50102000u,  /* DPPIC30 — GRTC at 0x500E_2000 + SPU/MPC at 0x501x_xxxx */
};
#define NRF54L_DPPIC_SIZE  0x1000u

void nrf54l_dppi_subscribe(nrf54l_dppi_state_t *d, int channel,
                           nrf54l_dppi_sub_cb cb, void *user) {
    if (channel < 0 || channel >= NRF54L_DPPI_NUM_CHANNELS) return;
    nrf54l_dppi_subscriber_t *s =
        (nrf54l_dppi_subscriber_t *)calloc(1, sizeof(*s));
    s->cb   = cb;
    s->user = user;
    s->next = d->subs[channel];
    d->subs[channel] = s;
}

void nrf54l_dppi_unsubscribe(nrf54l_dppi_state_t *d, int channel,
                             nrf54l_dppi_sub_cb cb, void *user) {
    if (channel < 0 || channel >= NRF54L_DPPI_NUM_CHANNELS) return;
    nrf54l_dppi_subscriber_t **slot = &d->subs[channel];
    while (*slot) {
        if ((*slot)->cb == cb && (*slot)->user == user) {
            nrf54l_dppi_subscriber_t *dead = *slot;
            *slot = dead->next;
            free(dead);
            return;
        }
        slot = &(*slot)->next;
    }
}

void nrf54l_dppi_publish(nrf54l_dppi_state_t *d, int channel) {
    if (channel < 0 || channel >= NRF54L_DPPI_NUM_CHANNELS) return;
    if (!(d->chen & (1u << channel))) return;   /* channel gated off */
    for (nrf54l_dppi_subscriber_t *s = d->subs[channel]; s; s = s->next)
        s->cb(s->user);
}

static int nrf54l_dppic_read(void *user_data, uint32_t addr) {
    nrf54l_dppi_state_t *d = (nrf54l_dppi_state_t *)user_data;
    /* DPPIC bases overlap by region in addressing; the meaningful sub-
     * offset is the low 12 bits. */
    uint32_t off = addr & 0xFFFu;
    switch (off) {
        case NRF54L_DPPI_CHEN:
        case NRF54L_DPPI_CHENSET:
            return (int)d->chen;
        default: return 0;
    }
}

static void nrf54l_dppic_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf54l_dppi_state_t *d = (nrf54l_dppi_state_t *)user_data;
    uint32_t off = addr & 0xFFFu;
    switch (off) {
        case NRF54L_DPPI_CHEN:    d->chen  = value;  break;
        case NRF54L_DPPI_CHENSET: d->chen |= value;  break;
        case NRF54L_DPPI_CHENCLR: d->chen &= ~value; break;
        default: /* TASKS_CHG, SUBSCRIBE_CHG, CHG cluster: no-op */ break;
    }
}

/* ============================================================
 * Peripheral aliases on nrf54l
 *
 * Contiki's nrf54l15 build maps every peripheral via the 0x5xxx_xxxx
 * alias (the secure-mapped window), not the 0x4xxx_xxxx non-secure
 * base.  Confirmed by `objdump -d` of the firmware: no 0x4008A000
 * literals, but 0x5008A000 (RADIO_S), 0x500E2000 (GRTC_S), 0x500C6000
 * (UARTE20_S).  Stick with 0x5xxx for every nrf54l peripheral.
 * ============================================================ */

/* ============================================================
 * GRTC (Global Real-Time Counter) at 0x500E_2000
 *
 * Drives Contiki's clock_arch tick (1 MHz syscounter) and is the
 * timer MPSL hands to nrf_802154 for timeslot grants.  Without GRTC
 * compare events firing, the radio driver never enables RX/TX.
 *
 * Register offsets (per nrf54lv10a_enga_application.svd):
 *   0x000+4n  TASKS_CAPTURE[0..11]   — latch counter into CC[n].CCL/CCH
 *   0x060     TASKS_START
 *   0x064     TASKS_STOP
 *   0x068     TASKS_CLEAR
 *   0x100+4n  EVENTS_COMPARE[0..11]
 *   0x300     INTEN0   (bit n = COMPARE[n] enable)
 *   0x304     INTENSET0
 *   0x308     INTENCLR0
 *   0x30C     INTPEND0
 *   0x310+10*k INTEN1/2/3 (one per GRTC IRQ line; we only fire GRTC_2)
 *   0x510     MODE
 *   0x520+10n CC[n].CCL    (compare value low 32 bits)
 *   0x524+10n CC[n].CCH    (compare value high 32 bits)
 *   0x528+10n CC[n].CCADD  (relative offset from now — used by nrfx_grtc
 *                            _syscounter_cc_relative_set; firmware writes
 *                            this then sets CCEN, model schedules event)
 *   0x52C+10n CC[n].CCEN   (write 1 to arm, 0 to disarm)
 *   0x720     SYSCOUNTER[0].SYSCOUNTERL  (32-bit low half)
 *   0x724     SYSCOUNTER[0].SYSCOUNTERH  (32-bit high half + LOADED bit)
 *   0x748     SYSCOUNTER[0] capture-ready (write 1 → latch L/H)
 *
 * Counter rate is 1 MHz (1 µs per tick) per Contiki's
 * GRTC_TICK_FREQUENCY_HZ = 1_000_000.  We compute the counter from
 * sim_time_ns: counter = (sim_time_ns - start_anchor_ns) / 1000.
 * ============================================================ */
#define NRF54L_GRTC_BASE                  0x500E2000u
#define NRF54L_GRTC_SIZE                  0x1000u

#define NRF54L_GRTC_TASKS_CAPTURE_BASE    0x000
#define NRF54L_GRTC_TASKS_START           0x060
#define NRF54L_GRTC_TASKS_STOP            0x064
#define NRF54L_GRTC_TASKS_CLEAR           0x068
#define NRF54L_GRTC_EVENTS_COMPARE_BASE   0x100
#define NRF54L_GRTC_PUBLISH_COMPARE_BASE  0x180
/* GRTC has 4 IRQ lines (GRTC_0..3) with their own INTEN bank each.
 * Contiki nrf54l15 routes its tick through GRTC_2 (IRQ 228), so we
 * only care about INTEN2.  Other banks are accepted as no-ops. */
#define NRF54L_GRTC_INTEN0                0x300
#define NRF54L_GRTC_INTENSET0             0x304
#define NRF54L_GRTC_INTENCLR0             0x308
#define NRF54L_GRTC_INTEN2                0x320
#define NRF54L_GRTC_INTENSET2             0x324
#define NRF54L_GRTC_INTENCLR2             0x328
#define NRF54L_GRTC_CC_BASE               0x520
#define NRF54L_GRTC_CC_STRIDE             0x10
#define NRF54L_GRTC_CC_END                (NRF54L_GRTC_CC_BASE + NRF54L_GRTC_NUM_CC * NRF54L_GRTC_CC_STRIDE)
/* SYSCOUNTER cluster at 0x720, dim=4, dimIncrement=0x10.  Each entry
 * is one CPU's view of the 52-bit counter (L+H pair):
 *   SYSCOUNTER[0]: 0x720/0x724  (secure)
 *   SYSCOUNTER[1]: 0x730/0x734
 *   SYSCOUNTER[2]: 0x740/0x744  (application core — what Contiki reads)
 *   SYSCOUNTER[3]: 0x750/0x754  (FLPR)
 * All four return the same logical counter in csim (we don't simulate
 * per-CPU views).  Bit 29 = LOADED, 30 = BUSY, 31 = OVERFLOW. */
#define NRF54L_GRTC_SYSCOUNTER_BASE       0x720
#define NRF54L_GRTC_SYSCOUNTER_END        0x760

#define NRF54L_GRTC_TICK_NS               1000    /* 1 MHz syscounter */
#define NRF54L_GRTC_IRQ                   228     /* GRTC_2_IRQn on app core */

/* Live "now" in ns derived from CPU cycles. cpu->sim_time_ns is only
 * synced at arm_step / arm_step_until boundaries, so reads from
 * within an IRQ handler (e.g. nrfx GRTC re-arming the next compare)
 * see the value frozen at the start of the current step — making
 * every fire_ns we compute one-step-of-staleness late, which on the
 * multinode harness manifests as a ~50× tick-rate slowdown.
 * Same root cause as the cc2538 sleeptimer fix. */
static inline int64_t grtc_now_ns(nrf54l_grtc_state_t *grtc) {
    arm_cpu_t *cpu = &grtc->plat->cpu;
    return arm_cycles_to_ns(cpu->cycles, cpu->cpu_freq_hz);
}

static uint64_t grtc_counter_now(nrf54l_grtc_state_t *grtc) {
    if (!grtc->running) return 0;
    int64_t elapsed = grtc_now_ns(grtc) - grtc->start_anchor_ns;
    if (elapsed < 0) elapsed = 0;
    return (uint64_t)elapsed / NRF54L_GRTC_TICK_NS;
}

/* Forward declaration */
static void nrf54l_grtc_compare_fire(void *user_data, cpu_event_t *event);

static void nrf54l_grtc_arm_cc(nrf54l_grtc_state_t *grtc, int idx) {
    nrf54l_grtc_cc_t *cc = &grtc->cc[idx];
    if (!cc->event) {
        cc->event = (cpu_event_t *)calloc(1, sizeof(cpu_event_t));
        ((cpu_event_t *)cc->event)->callback  = nrf54l_grtc_compare_fire;
        /* user_data = grtc; the callback iterates cc[] to find which
         * slot owns the fired event pointer. */
        ((cpu_event_t *)cc->event)->user_data = grtc;
    }
    arm_cancel_event(&grtc->plat->cpu, (arm_event_t *)cc->event);
    /* CCADD bit 31 selects the reference:
     *   1 (NRFX_GRTC_CC_RELATIVE_SYSCOUNTER) → fire at now + delay
     *   0 (NRFX_GRTC_CC_RELATIVE_COMPARE)    → fire at last_scheduled + delay
     * The COMPARE mode is drift-free: it ignores IRQ-handler latency
     * between the previous fire and this re-arm. Critical for the
     * Contiki etimer tick (clock-arch.c re-arms every 7813 µs in
     * COMPARE mode); using SYSCOUNTER semantics for it stretches the
     * effective tick by the IRQ overhead and slows wall-clock by ~1.7×. */
    uint32_t delay_ticks = cc->ccadd & 0x7FFFFFFFu;
    int64_t  delay_ns    = (int64_t)delay_ticks * NRF54L_GRTC_TICK_NS;
    int64_t  now_ns      = grtc_now_ns(grtc);
    int64_t  fire_ns;
    if ((cc->ccadd & 0x80000000u) || cc->scheduled_ns == 0) {
        fire_ns = now_ns + delay_ns;
    } else {
        /* RELATIVE_COMPARE: fire at scheduled_ns + delay regardless of
         * whether that time is already in the past. Real HW behaviour:
         * if the new compare target has already been passed by the
         * SYSCOUNTER, the comparator matches immediately and the IRQ
         * fires "back-to-back" with the previous one. Earlier code
         * clamped past targets forward to `now + delay`, which silently
         * dropped clock-tick events whenever an IRQ handler ran long.
         * That manifested as Contiki's CLOCK_SECOND counter advancing
         * at 56% of sim time and the udp-client etimer never reaching
         * its 10 s SEND_INTERVAL.
         *
         * arm_schedule_event_ns will fire the event on the next event
         * check after the CPU's cycle passes `fire_ns`, so handing it a
         * past timestamp just means "fire ASAP" — which is what real
         * comparator-already-matched semantics produce. */
        fire_ns = cc->scheduled_ns + delay_ns;
    }
    cc->scheduled_ns = fire_ns;
    arm_schedule_event_ns(&grtc->plat->cpu, (arm_event_t *)cc->event, fire_ns);
}

static void nrf54l_grtc_compare_fire(void *user_data, cpu_event_t *event) {
    nrf54l_grtc_state_t *grtc = (nrf54l_grtc_state_t *)user_data;
    /* Find which CC slot owns this event. */
    int idx = -1;
    for (int i = 0; i < NRF54L_GRTC_NUM_CC; i++) {
        if (grtc->cc[i].event == event) { idx = i; break; }
    }
    if (idx < 0) return;
    /* Latch the event and pend the IRQ if enabled. */
    grtc->evt_compare[idx] = 1;
    if (grtc->inten & (1u << idx)) {
        arm_nvic_set_pending(&grtc->plat->nvic, grtc->irq_num);
    }
    /* Publish on the DPPI channel configured by PUBLISH_COMPARE[idx]
     * (bit 31 = EN, bits 4..0 = channel ID).  This is how MPSL routes
     * GRTC ticks to RADIO TASKS_TXEN / _RXEN. */
    uint32_t pub = grtc->publish_compare[idx];
    if (grtc->dppi && (pub & 0x80000000u))
        nrf54l_dppi_publish(grtc->dppi, (int)(pub & 0x1Fu));
    /* CCEN remains set in our model — firmware re-arms by writing
     * a new CCADD value, so we don't auto-disarm. */
}

static int nrf54l_grtc_read(void *user_data, uint32_t addr) {
    nrf54l_grtc_state_t *grtc = (nrf54l_grtc_state_t *)user_data;
    uint32_t off = addr - NRF54L_GRTC_BASE;

    /* EVENTS_COMPARE[0..11] */
    if (off >= NRF54L_GRTC_EVENTS_COMPARE_BASE &&
        off < NRF54L_GRTC_EVENTS_COMPARE_BASE + 4 * NRF54L_GRTC_NUM_CC) {
        int idx = (off - NRF54L_GRTC_EVENTS_COMPARE_BASE) / 4;
        return (int)grtc->evt_compare[idx];
    }

    /* PUBLISH_COMPARE[0..11] */
    if (off >= NRF54L_GRTC_PUBLISH_COMPARE_BASE &&
        off < NRF54L_GRTC_PUBLISH_COMPARE_BASE + 4 * NRF54L_GRTC_NUM_CC) {
        int idx = (off - NRF54L_GRTC_PUBLISH_COMPARE_BASE) / 4;
        return (int)grtc->publish_compare[idx];
    }

    /* CC[0..11].(CCL/CCH/CCADD/CCEN) */
    if (off >= NRF54L_GRTC_CC_BASE && off < NRF54L_GRTC_CC_END) {
        int idx = (off - NRF54L_GRTC_CC_BASE) / NRF54L_GRTC_CC_STRIDE;
        int sub = (off - NRF54L_GRTC_CC_BASE) % NRF54L_GRTC_CC_STRIDE;
        switch (sub) {
            case 0x0: return (int)grtc->cc[idx].ccl;
            case 0x4: return (int)grtc->cc[idx].cch;
            case 0x8: return (int)grtc->cc[idx].ccadd;
            case 0xC: return (int)grtc->cc[idx].ccen;
        }
    }

    /* SYSCOUNTER[n] cluster — any of the 4 CPUs' views maps to the same
     * counter in our model.  Offsets 0x720..0x75F. */
    if (off >= NRF54L_GRTC_SYSCOUNTER_BASE && off < NRF54L_GRTC_SYSCOUNTER_END) {
        int sub = (off - NRF54L_GRTC_SYSCOUNTER_BASE) % 0x10;
        /* SYSCOUNTERL/H always return the live 1 MHz counter. nrfx
         * issues an atomic L→H read pair; we don't model the
         * roll-over hazard since both halves come from the same
         * grtc_counter_now() snapshot in 64-bit. The captured_lo/hi
         * scratch slots are populated by the capture-trigger write
         * (sub == 0x8) but never gate reads — earlier code did and
         * pinned SYSCOUNTERL to the boot-time capture, breaking
         * every nrfx_grtc_syscounter_get() after the first one. */
        if (sub == 0x0) {  /* SYSCOUNTERL */
            uint64_t c = grtc_counter_now(grtc);
            return (int)(uint32_t)c;
        }
        if (sub == 0x4) {  /* SYSCOUNTERH (LOADED bit at 29) */
            uint64_t c = grtc_counter_now(grtc);
            return (int)(((uint32_t)(c >> 32) & 0xFFFFFu) | (1u << 29));
        }
        if (sub == 0x8) return 1;  /* CAPTURE control — always ready */
        return 0;
    }
    switch (off) {
        case NRF54L_GRTC_INTEN0:
        case NRF54L_GRTC_INTENSET0:
            return 0;       /* GRTC_0 IRQ unused by Contiki */
        case NRF54L_GRTC_INTEN2:
        case NRF54L_GRTC_INTENSET2:
            return (int)grtc->inten;
        case 0x32C: {       /* INTPEND2 — pending+enabled bitmap */
            uint32_t pending = 0;
            for (int i = 0; i < NRF54L_GRTC_NUM_CC; i++) {
                if (grtc->evt_compare[i] && (grtc->inten & (1u << i)))
                    pending |= (1u << i);
            }
            return (int)pending;
        }
        default: return 0;
    }
}

static void nrf54l_grtc_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf54l_grtc_state_t *grtc = (nrf54l_grtc_state_t *)user_data;
    uint32_t off = addr - NRF54L_GRTC_BASE;

    /* EVENTS_COMPARE clears */
    if (off >= NRF54L_GRTC_EVENTS_COMPARE_BASE &&
        off < NRF54L_GRTC_EVENTS_COMPARE_BASE + 4 * NRF54L_GRTC_NUM_CC) {
        int idx = (off - NRF54L_GRTC_EVENTS_COMPARE_BASE) / 4;
        grtc->evt_compare[idx] = value & 1;
        return;
    }

