nvt/cooja-ng/src/arm/nrf54l15_soc.c
    /* PUBLISH_COMPARE writes — store channel routing for compare-fire. */
    if (off >= NRF54L_GRTC_PUBLISH_COMPARE_BASE &&
        off < NRF54L_GRTC_PUBLISH_COMPARE_BASE + 4 * NRF54L_GRTC_NUM_CC) {
        int idx = (off - NRF54L_GRTC_PUBLISH_COMPARE_BASE) / 4;
        grtc->publish_compare[idx] = value;
        return;
    }

    /* SYSCOUNTER[n] writes — write 1 to the +0x8 control reg captures
     * the counter into the L/H pair. */
    if (off >= NRF54L_GRTC_SYSCOUNTER_BASE && off < NRF54L_GRTC_SYSCOUNTER_END) {
        int sub = (off - NRF54L_GRTC_SYSCOUNTER_BASE) % 0x10;
        if (sub == 0x8) {
            if (value == 1) {
                uint64_t c = grtc_counter_now(grtc);
                grtc->captured_lo = (uint32_t)c;
                grtc->captured_hi = (uint32_t)(c >> 32);
            } else {
                grtc->captured_lo = 0;
                grtc->captured_hi = 0;
            }
        }
        return;
    }

    /* CC[0..11] writes */
    if (off >= NRF54L_GRTC_CC_BASE && off < NRF54L_GRTC_CC_END) {
        int idx = (off - NRF54L_GRTC_CC_BASE) / NRF54L_GRTC_CC_STRIDE;
        int sub = (off - NRF54L_GRTC_CC_BASE) % NRF54L_GRTC_CC_STRIDE;
        switch (sub) {
            case 0x0: grtc->cc[idx].ccl   = value; break;
            case 0x4: grtc->cc[idx].cch   = value; break;
            case 0x8:
                grtc->cc[idx].ccadd = value;
                if (grtc->cc[idx].ccen && grtc->running)
                    nrf54l_grtc_arm_cc(grtc, idx);
                break;
            case 0xC:
                grtc->cc[idx].ccen = value & 1;
                if (grtc->cc[idx].ccen && grtc->running)
                    nrf54l_grtc_arm_cc(grtc, idx);
                else if (!grtc->cc[idx].ccen && grtc->cc[idx].event)
                    arm_cancel_event(&grtc->plat->cpu,
                                      (arm_event_t *)grtc->cc[idx].event);
                break;
        }
        return;
    }

    switch (off) {
        case NRF54L_GRTC_TASKS_START:
            if (value == 1) {
                grtc->running = true;
                grtc->start_anchor_ns = grtc_now_ns(grtc);
                /* Re-arm any pre-loaded CCs. */
                for (int i = 0; i < NRF54L_GRTC_NUM_CC; i++)
                    if (grtc->cc[i].ccen) nrf54l_grtc_arm_cc(grtc, i);
            }
            break;
        case NRF54L_GRTC_TASKS_STOP:
            if (value == 1) {
                grtc->running = false;
                for (int i = 0; i < NRF54L_GRTC_NUM_CC; i++)
                    if (grtc->cc[i].event)
                        arm_cancel_event(&grtc->plat->cpu,
                                          (arm_event_t *)grtc->cc[i].event);
            }
            break;
        case NRF54L_GRTC_TASKS_CLEAR:
            if (value == 1) grtc->start_anchor_ns = grtc_now_ns(grtc);
            break;
        case NRF54L_GRTC_INTEN2:    grtc->inten  = value;          break;
        case NRF54L_GRTC_INTENSET2: grtc->inten |= value;          break;
        case NRF54L_GRTC_INTENCLR2: grtc->inten &= ~value;         break;
        default:
            /* Accept SHORTS, PUBLISH/SUBSCRIBE, MODE, INTEN0/1/3,
             * TASKS_CAPTURE[n], etc. as no-ops. */
            break;
    }
}

/* ============================================================
 * EGU (Event Generator Unit) — software-trigger → DPPI bridge.
 *
 * Three instances on nrf54l15: EGU00 (0x5001_5000), EGU10 (0x5008_7000,
 * paired with RADIO), EGU20 (0x500C_7000).  The Nordic nrf_802154
 * driver uses EGU10 as the "kick" point for ramp-up: CPU writes
 * TASKS_TRIGGER[15] → EVENTS_TRIGGERED[15] fires → PUBLISH_TRIGGERED[15]
 * publishes on its bound channel → RADIO.SUBSCRIBE_RXEN catches it.
 *
 * Register layout (per the SVD):
 *   0x000+4n  TASKS_TRIGGER[0..15]
 *   0x080+4n  SUBSCRIBE_TRIGGER[0..15]
 *   0x100+4n  EVENTS_TRIGGERED[0..15]
 *   0x180+4n  PUBLISH_TRIGGERED[0..15]
 *   0x300/4/8 INTEN / INTENSET / INTENCLR
 *   0x30C     INTPEND
 * ============================================================ */
#define NRF54L_EGU00_BASE  0x50015000u
#define NRF54L_EGU10_BASE  0x50087000u
#define NRF54L_EGU10_IRQ   135    /* EGU10_IRQn — SWI dispatch for nrf_802154 */
#define NRF54L_EGU20_BASE  0x500C7000u
#define NRF54L_EGU_SIZE    0x1000u

#define E_TASKS_BASE       0x000
#define E_SUBSCRIBE_BASE   0x080
#define E_EVENTS_BASE      0x100
#define E_PUBLISH_BASE     0x180
#define E_INTEN            0x300
#define E_INTENSET         0x304
#define E_INTENCLR         0x308
#define E_INTPEND          0x30C

/* Forward decl */
static void egu_fire_event(nrf54l_egu_state_t *e, int n);

/* SUBSCRIBE binding storage — one slot per (EGU, channel) — used to
 * dispatch DPPI publishes back into the right TASKS_TRIGGER[n]. */
typedef struct {
    nrf54l_egu_state_t *egu;
    int                 task_n;
} egu_sub_binding_t;
static egu_sub_binding_t egu_sub_bindings[3 /* EGU instances */ * NRF54L_EGU_NUM_CHANNELS];

static void egu_sub_cb(void *user) {
    egu_sub_binding_t *b = (egu_sub_binding_t *)user;
    egu_fire_event(b->egu, b->task_n);
}

static void egu_fire_event(nrf54l_egu_state_t *e, int n) {
    if (n < 0 || n >= NRF54L_EGU_NUM_CHANNELS) return;
    e->events[n] = 1;
    if ((e->inten & (1u << n)) && e->irq_num >= 0)
        arm_nvic_set_pending(&e->plat->nvic, e->irq_num);
    uint32_t pub = e->publish[n];
    if ((pub & 0x80000000u) && e->dppi)
        nrf54l_dppi_publish(e->dppi, (int)(pub & 0x1Fu));
}

static int nrf54l_egu_read(void *user_data, uint32_t addr) {
    nrf54l_egu_state_t *e = (nrf54l_egu_state_t *)user_data;
    uint32_t off = addr & 0xFFFu;
    if (off >= E_SUBSCRIBE_BASE && off < E_SUBSCRIBE_BASE + 4 * NRF54L_EGU_NUM_CHANNELS)
        return (int)e->subscribe[(off - E_SUBSCRIBE_BASE) / 4];
    if (off >= E_EVENTS_BASE && off < E_EVENTS_BASE + 4 * NRF54L_EGU_NUM_CHANNELS)
        return (int)e->events[(off - E_EVENTS_BASE) / 4];
    if (off >= E_PUBLISH_BASE && off < E_PUBLISH_BASE + 4 * NRF54L_EGU_NUM_CHANNELS)
        return (int)e->publish[(off - E_PUBLISH_BASE) / 4];
    switch (off) {
        case E_INTEN:
        case E_INTENSET: return (int)e->inten;
        default:         return 0;
    }
}

static void nrf54l_egu_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf54l_egu_state_t *e = (nrf54l_egu_state_t *)user_data;
    uint32_t off = addr & 0xFFFu;
    /* TASKS_TRIGGER[0..15] — write 1 to fire. */
    if (off < E_TASKS_BASE + 4 * NRF54L_EGU_NUM_CHANNELS) {
        if (value == 1) egu_fire_event(e, (off - E_TASKS_BASE) / 4);
        return;
    }
    /* SUBSCRIBE_TRIGGER[n] — bind/unbind DPPI channel. */
    if (off >= E_SUBSCRIBE_BASE && off < E_SUBSCRIBE_BASE + 4 * NRF54L_EGU_NUM_CHANNELS) {
        int idx = (off - E_SUBSCRIBE_BASE) / 4;
        e->subscribe[idx] = value;
        /* Find this instance's binding slot. */
        int instance_off = 0;
        nrf54l15_soc_t *soc = (nrf54l15_soc_t *)e->plat->soc;
        if (e == &soc->egu00)      instance_off = 0;
        else if (e == &soc->egu10) instance_off = NRF54L_EGU_NUM_CHANNELS;
        else                        instance_off = 2 * NRF54L_EGU_NUM_CHANNELS;
        egu_sub_binding_t *binding = &egu_sub_bindings[instance_off + idx];
        if (e->sub_channel[idx] >= 0) {
            nrf54l_dppi_unsubscribe(e->dppi, e->sub_channel[idx], egu_sub_cb, binding);
            e->sub_channel[idx] = -1;
        }
        if (value & 0x80000000u) {
            int ch = (int)(value & 0x1Fu);
            binding->egu     = e;
            binding->task_n  = idx;
            nrf54l_dppi_subscribe(e->dppi, ch, egu_sub_cb, binding);
            e->sub_channel[idx] = ch;
        }
        return;
    }
    /* EVENTS_TRIGGERED[n] — firmware clears. */
    if (off >= E_EVENTS_BASE && off < E_EVENTS_BASE + 4 * NRF54L_EGU_NUM_CHANNELS) {
        e->events[(off - E_EVENTS_BASE) / 4] = value & 1;
        return;
    }
    /* PUBLISH_TRIGGERED[n] — store for later. */
    if (off >= E_PUBLISH_BASE && off < E_PUBLISH_BASE + 4 * NRF54L_EGU_NUM_CHANNELS) {
        e->publish[(off - E_PUBLISH_BASE) / 4] = value;
        return;
    }
    switch (off) {
        case E_INTEN:    e->inten  = value;  break;
        case E_INTENSET: e->inten |= value;  break;
        case E_INTENCLR: e->inten &= ~value; break;
        default: break;
    }
}

/* ============================================================
 * RADIO (0x5008_A000)
 *
 * IEEE 802.15.4 PHY.  Programmed via Nordic's nrf_802154 SDK driver,
 * which routes every task trigger through DPPI rather than writing
 * task registers directly.  We model:
 *
 *   - State machine: DISABLED ↔ RXIDLE/RX ↔ TXIDLE/TX (no rampup
 *     delays — entry events fire immediately on state change).
 *   - SUBSCRIBE_<task>: write `0x80000000 | channel` to bind the
 *     task to a DPPI channel; we register a DPPI subscriber that
 *     triggers the task when the channel fires.
 *   - PUBLISH_<event>: write `0x80000000 | channel` to publish the
 *     event on a DPPI channel; we call `dppi_publish(channel)`
 *     whenever the event latches.
 *   - SHORTS (0x400): READY_START / TXREADY_START / RXREADY_START
 *     / PHYEND_DISABLE / END_DISABLE bits auto-chain on entry.
 *   - INTENSET00 / INTENSET10: per-event masks for two NVIC IRQ
 *     lines (RADIO_0 = 138, RADIO_1 = 139).
 *   - EasyDMA TX: TASKS_START in TXIDLE walks PACKETPTR (PHR +
 *     payload), computes IEEE 802.15.4 FCS, emits preamble + SFD +
 *     PHR + payload + FCS to the multinode TX listener.
 *   - EasyDMA RX: byte stream parser feeds PACKETPTR; on frame
 *     end, fires CRCOK / END / PHYEND, sends auto-ACK if frame is
 *     a unicast Data with ACK_REQUEST set.
 *
 * Same FCS algorithm + auto-ACK shortcut as `nrf52840_soc.c`'s
 * radio model — just different register offsets and the DPPI
 * indirection.
 * ============================================================ */
#define NRF54L_RADIO_BASE              0x5008A000u
#define NRF54L_RADIO_SIZE              0x2000u
#define NRF54L_RADIO_IRQ_0             138
#define NRF54L_RADIO_IRQ_1             139

/* Task / SUBSCRIBE / EVENT / PUBLISH register offsets. */
#define R_TASKS_TXEN                   0x000
#define R_TASKS_RXEN                   0x004
#define R_TASKS_START                  0x008
#define R_TASKS_STOP                   0x00C
#define R_TASKS_DISABLE                0x010
#define R_TASKS_RSSISTART              0x014
#define R_TASKS_BCSTART                0x018
#define R_TASKS_BCSTOP                 0x01C
#define R_TASKS_EDSTART                0x020
#define R_TASKS_EDSTOP                 0x024
#define R_TASKS_CCASTART               0x028
#define R_TASKS_CCASTOP                0x02C

#define R_SUBSCRIBE_BASE               0x100
#define R_SUBSCRIBE_END                (R_SUBSCRIBE_BASE + 4 * NRF54L_RADIO_NUM_SUBSCRIBES)
#define R_SUBSCRIBE_INDEX(off)         (((off) - R_SUBSCRIBE_BASE) / 4)

#define R_EVENTS_READY                 0x200
#define R_EVENTS_TXREADY               0x204
#define R_EVENTS_RXREADY               0x208
#define R_EVENTS_ADDRESS               0x20C
#define R_EVENTS_FRAMESTART            0x210
#define R_EVENTS_PAYLOAD               0x214
#define R_EVENTS_END                   0x218
#define R_EVENTS_PHYEND                0x21C
#define R_EVENTS_DISABLED              0x220
#define R_EVENTS_DEVMATCH              0x224
#define R_EVENTS_DEVMISS               0x228
#define R_EVENTS_CRCOK                 0x22C
#define R_EVENTS_CRCERROR              0x230
#define R_EVENTS_BCMATCH               0x238
#define R_EVENTS_EDEND                 0x23C
#define R_EVENTS_EDSTOPPED             0x240
#define R_EVENTS_CCAIDLE               0x244
#define R_EVENTS_CCABUSY               0x248
#define R_EVENTS_CCASTOPPED            0x24C
#define R_EVENTS_RATEBOOST             0x250
#define R_EVENTS_MHRMATCH              0x254
#define R_EVENTS_SYNC                  0x258
#define R_EVENTS_CTEPRESENT            0x25C

