nvt/cooja-ng/src/arm/nrf54l15_soc.c
#define R_PUBLISH_BASE                 0x300
#define R_PUBLISH_END                  (R_PUBLISH_BASE + 4 * NRF54L_RADIO_NUM_PUBLISHES)

#define R_SHORTS                       0x400
#define R_INTENSET00                   0x488
#define R_INTENCLR00                   0x490
#define R_INTENSET10                   0x4A8
#define R_INTENCLR10                   0x4B0
#define R_MODE                         0x500
#define R_STATE                        0x520
#define R_TIMING                       0x704
#define R_FREQUENCY                    0x708
#define R_TXPOWER                      0x710
#define R_TIFS                         0x714
#define R_PCNF0                        0xE20
#define R_PCNF1                        0xE28
#define R_CRCCNF                       0xE44
#define R_CRCPOLY                      0xE48
#define R_CRCINIT                      0xE4C
#define R_BCC                          0xE94
#define R_PACKETPTR                    0xED0
#define R_CRCSTATUS                    0xE0C
#define R_RXMATCH                      0xE10

/* INTENSET bit positions per the SVD.  Note bit 13 is reserved
 * (intentional gap), so BCMATCH is at bit 14 — confirmed against
 * nrf54l15_application.svd.  Get this wrong and BCMATCH interrupts
 * never fire (and the bit-13 EDEND would fire spuriously). */
enum {
    INT_READY      = 0,
    INT_TXREADY    = 1,
    INT_RXREADY    = 2,
    INT_ADDRESS    = 3,
    INT_FRAMESTART = 4,
    INT_PAYLOAD    = 5,
    INT_END        = 6,
    INT_PHYEND     = 7,
    INT_DISABLED   = 8,
    INT_DEVMATCH   = 9,
    INT_DEVMISS    = 10,
    INT_CRCOK      = 11,
    INT_CRCERROR   = 12,
    /* bit 13 reserved */
    INT_BCMATCH    = 14,
    INT_EDEND      = 15,
    INT_EDSTOPPED  = 16,
    INT_CCAIDLE    = 17,
    INT_CCABUSY    = 18,
    INT_CCASTOPPED = 19,
    INT_RATEBOOST  = 20,
    INT_MHRMATCH   = 21,
    INT_SYNC       = 26,
    INT_CTEPRESENT = 27,
};

/* PUBLISH index ↔ event mapping.  Both clusters are indexed by the
 * same enum (READY = 0 through CTEPRESENT). */
enum {
    PUB_READY = 0, PUB_TXREADY, PUB_RXREADY, PUB_ADDRESS,
    PUB_FRAMESTART, PUB_PAYLOAD, PUB_END, PUB_PHYEND,
    PUB_DISABLED, PUB_DEVMATCH, PUB_DEVMISS, PUB_CRCOK,
    PUB_CRCERROR, /* skip */ PUB_BCMATCH = 14, PUB_EDEND, PUB_EDSTOPPED,
    PUB_CCAIDLE, PUB_CCABUSY, PUB_CCASTOPPED, PUB_RATEBOOST,
    PUB_MHRMATCH, PUB_SYNC, PUB_CTEPRESENT
};
/* (BCMATCH is at 0x338 not 0x334 due to a gap — index 13 is unused.) */

/* SHORTS bits — taken from <lsb> entries in the SVD (do NOT match the
 * sequential order of field declarations; bits 1, 7-9, etc. are
 * reserved). */
#define R_SHORT_READY_START          (1u <<  0)
#define R_SHORT_DISABLED_TXEN        (1u <<  2)
#define R_SHORT_DISABLED_RXEN        (1u <<  3)
#define R_SHORT_ADDRESS_RSSISTART    (1u <<  4)
#define R_SHORT_END_START            (1u <<  5)
#define R_SHORT_ADDRESS_BCSTART      (1u <<  6)
#define R_SHORT_RXREADY_CCASTART     (1u << 10)
#define R_SHORT_CCAIDLE_TXEN         (1u << 11)
#define R_SHORT_CCABUSY_DISABLE      (1u << 12)
#define R_SHORT_FRAMESTART_BCSTART   (1u << 13)
#define R_SHORT_READY_EDSTART        (1u << 14)
#define R_SHORT_EDEND_DISABLE        (1u << 15)
#define R_SHORT_CCAIDLE_STOP         (1u << 16)
#define R_SHORT_TXREADY_START        (1u << 17)
#define R_SHORT_RXREADY_START        (1u << 18)
#define R_SHORT_PHYEND_DISABLE       (1u << 19)
#define R_SHORT_PHYEND_START         (1u << 20)

/* IEEE 802.15.4 PHY constants (PREAMBLE_BYTE/LEN/SFD) and the RX
 * phase enum live in include/common/ieee_802154.h — shared with cc2420,
 * cc2538_rfcore, nrf52840.  Local NRF54L_RX_* aliases avoid churn in
 * the existing switch statements. */
#define NRF54L_RX_WAIT_PREAMBLE IEEE802154_RX_WAIT_PREAMBLE
#define NRF54L_RX_WAIT_SFD      IEEE802154_RX_WAIT_SFD
#define NRF54L_RX_READ_PHR      IEEE802154_RX_READ_PHR
#define NRF54L_RX_READ_PAYLOAD  IEEE802154_RX_READ_PAYLOAD

/* SUBSCRIBE-slot binding — one per task-index 0..11, lives inside
 * the radio state.  DPPI subscriber callback receives a pointer to
 * one of these and triggers the task at `task_off`. */
typedef struct {
    nrf54l_radio_state_t *radio;
    uint32_t              task_off;
} radio_sub_binding_t;
static radio_sub_binding_t radio_sub_bindings[NRF54L_RADIO_NUM_SUBSCRIBES];
static const uint32_t radio_sub_task_off[NRF54L_RADIO_NUM_SUBSCRIBES] = {
    R_TASKS_TXEN, R_TASKS_RXEN, R_TASKS_START, R_TASKS_STOP,
    R_TASKS_DISABLE, R_TASKS_RSSISTART, R_TASKS_BCSTART, R_TASKS_BCSTOP,
    R_TASKS_EDSTART, R_TASKS_EDSTOP, R_TASKS_CCASTART, R_TASKS_CCASTOP,
};

/* Forward declarations. */
static void nrf54l_radio_trigger_task(nrf54l_radio_state_t *r, uint32_t task_off);
static void nrf54l_radio_tx_end_cb(void *user, arm_event_t *ev);
static void nrf54l_radio_apply_shorts(nrf54l_radio_state_t *r, uint32_t after_event_bit);
static void nrf54l_radio_publish_event(nrf54l_radio_state_t *r, int pub_idx);
static void nrf54l_radio_set_state(nrf54l_radio_state_t *r, uint32_t new_state);
static void nrf54l_radio_emit_tx(nrf54l_radio_state_t *r);

/* CCITT-16 CRC matching IEEE 802.15.4 FCS — shared with cc2420 /
 * cc2538_rfcore / nrf52840 via ieee_802154.h. */
#define nrf54l_crc_add(crc, data) ieee802154_crc_add((crc), (data))

/* NRF54L_RADIO_TRACE=1 — driver-level trace of radio activity (state
 * transitions, tasks, events, IRQs).  Cached on first call.  Optionally
 * filter by node tag (low 16 bits of cpu pointer) via NRF54L_RADIO_NODE. */
static int nrf54l_radio_trace_enabled = -1;
static uint32_t nrf54l_radio_trace_node = 0;
static void nrf54l_radio_trace_probe(void) {
    const char *e = getenv("NRF54L_RADIO_TRACE");
    nrf54l_radio_trace_enabled = (e && *e && *e != '0') ? 1 : 0;
    const char *n = getenv("NRF54L_RADIO_NODE");
    if (n) nrf54l_radio_trace_node = (uint32_t)strtoul(n, NULL, 0);
}
static inline int nrf54l_radio_trace_active(nrf54l_radio_state_t *r) {
    if (nrf54l_radio_trace_enabled < 0) nrf54l_radio_trace_probe();
    if (!nrf54l_radio_trace_enabled) return 0;
    if (nrf54l_radio_trace_node) {
        uint32_t tag = (uint32_t)((uintptr_t)&r->plat->cpu & 0xFFFF);
        if (tag != nrf54l_radio_trace_node) return 0;
    }
    return 1;
}
static const char *nrf54l_radio_state_name(uint32_t s) {
    switch (s) {
        case NRF54L_RADIO_STATE_DISABLED:  return "DISABLED";
        case NRF54L_RADIO_STATE_RXRU:      return "RXRU";
        case NRF54L_RADIO_STATE_RXIDLE:    return "RXIDLE";
        case NRF54L_RADIO_STATE_RX:        return "RX";
        case NRF54L_RADIO_STATE_RXDISABLE: return "RXDISABLE";
        case NRF54L_RADIO_STATE_TXRU:      return "TXRU";
        case NRF54L_RADIO_STATE_TXIDLE:    return "TXIDLE";
        case NRF54L_RADIO_STATE_TX:        return "TX";
        case NRF54L_RADIO_STATE_TXDISABLE: return "TXDISABLE";
        default:                            return "?";
    }
}
static const char *nrf54l_radio_event_name(int int_bit) {
    switch (int_bit) {
        case INT_READY:      return "READY";
        case INT_TXREADY:    return "TXREADY";
        case INT_RXREADY:    return "RXREADY";
        case INT_ADDRESS:    return "ADDRESS";
        case INT_FRAMESTART: return "FRAMESTART";
        case INT_PAYLOAD:    return "PAYLOAD";
        case INT_END:        return "END";
        case INT_PHYEND:     return "PHYEND";
        case INT_DISABLED:   return "DISABLED";
        case INT_DEVMATCH:   return "DEVMATCH";
        case INT_DEVMISS:    return "DEVMISS";
        case INT_CRCOK:      return "CRCOK";
        case INT_CRCERROR:   return "CRCERROR";
        case INT_BCMATCH:    return "BCMATCH";
        case INT_EDEND:      return "EDEND";
        case INT_CCAIDLE:    return "CCAIDLE";
        case INT_CCABUSY:    return "CCABUSY";
        default:              return "?";
    }
}
static const char *nrf54l_radio_task_name(uint32_t off) {
    switch (off) {
        case R_TASKS_TXEN:      return "TXEN";
        case R_TASKS_RXEN:      return "RXEN";
        case R_TASKS_START:     return "START";
        case R_TASKS_STOP:      return "STOP";
        case R_TASKS_DISABLE:   return "DISABLE";
        case R_TASKS_RSSISTART: return "RSSISTART";
        case R_TASKS_BCSTART:   return "BCSTART";
        case R_TASKS_BCSTOP:    return "BCSTOP";
        case R_TASKS_CCASTART:  return "CCASTART";
        default:                 return "?";
    }
}

/* Fire an event: latch the bit, raise IRQs whose INTENSET matches, and
 * publish on the configured DPPI channel.  `pub_idx` is the PUBLISH
 * cluster index (PUB_READY..PUB_CTEPRESENT). */
static void nrf54l_radio_fire_event(nrf54l_radio_state_t *r,
                                     uint32_t *evt, int int_bit, int pub_idx) {
    *evt = 1;
    int irq_raised = 0;
    if (r->intenset00 & (1u << int_bit)) {
        arm_nvic_set_pending(&r->plat->nvic, r->irq_num_0);
        irq_raised |= 1;
    }
    if (r->intenset10 & (1u << int_bit)) {
        arm_nvic_set_pending(&r->plat->nvic, r->irq_num_1);
        irq_raised |= 2;
    }
    nrf54l_radio_publish_event(r, pub_idx);
    if (nrf54l_radio_trace_active(r)) {
        uint32_t pub = (pub_idx >= 0 && pub_idx < NRF54L_RADIO_NUM_PUBLISHES)
                       ? r->publish[pub_idx] : 0;
        fprintf(stderr, "[radio cpu=0x%04x cyc=%lld EVENT %-10s irq=%d pub=0x%x state=%s]\n",
                (unsigned)((uintptr_t)&r->plat->cpu & 0xFFFF),
                (long long)r->plat->cpu.cycles,
                nrf54l_radio_event_name(int_bit), irq_raised, pub,
                nrf54l_radio_state_name(r->state));
    }
}

static void nrf54l_radio_publish_event(nrf54l_radio_state_t *r, int pub_idx) {
    if (pub_idx < 0 || pub_idx >= NRF54L_RADIO_NUM_PUBLISHES) return;
    uint32_t pub = r->publish[pub_idx];
    if ((pub & 0x80000000u) && r->dppi)
        nrf54l_dppi_publish(r->dppi, (int)(pub & 0x1Fu));
}

static void nrf54l_radio_apply_shorts(nrf54l_radio_state_t *r, uint32_t after_event_bit) {
    if (!(r->shorts & after_event_bit)) return;
    switch (after_event_bit) {
        case R_SHORT_READY_START:
        case R_SHORT_TXREADY_START:
        case R_SHORT_RXREADY_START:
        case R_SHORT_END_START:
        case R_SHORT_PHYEND_START:
            nrf54l_radio_trigger_task(r, R_TASKS_START);    break;
        case R_SHORT_DISABLED_TXEN:
            nrf54l_radio_trigger_task(r, R_TASKS_TXEN);     break;
        case R_SHORT_DISABLED_RXEN:
            nrf54l_radio_trigger_task(r, R_TASKS_RXEN);     break;
        case R_SHORT_PHYEND_DISABLE:
        case R_SHORT_CCABUSY_DISABLE:
        case R_SHORT_EDEND_DISABLE:
            nrf54l_radio_trigger_task(r, R_TASKS_DISABLE);  break;
        case R_SHORT_CCAIDLE_TXEN:
            nrf54l_radio_trigger_task(r, R_TASKS_TXEN);     break;
        case R_SHORT_CCAIDLE_STOP:
            nrf54l_radio_trigger_task(r, R_TASKS_STOP);     break;
        default: break;
    }
}

