nvt/cooja-ng/src/arm/nrf54l15_soc.c
static void nrf54l_radio_set_state(nrf54l_radio_state_t *r, uint32_t new_state) {
    if (nrf54l_radio_trace_active(r) && new_state != r->state) {
        fprintf(stderr, "[radio cpu=0x%04x cyc=%lld STATE  %-10s -> %s]\n",
                (unsigned)((uintptr_t)&r->plat->cpu & 0xFFFF),
                (long long)r->plat->cpu.cycles,
                nrf54l_radio_state_name(r->state),
                nrf54l_radio_state_name(new_state));
    }
    r->state = new_state;
    switch (new_state) {
        case NRF54L_RADIO_STATE_RXIDLE:
            nrf54l_radio_fire_event(r, &r->evt_ready,   INT_READY,   PUB_READY);
            nrf54l_radio_fire_event(r, &r->evt_rxready, INT_RXREADY, PUB_RXREADY);
            nrf54l_radio_apply_shorts(r, R_SHORT_READY_START);
            nrf54l_radio_apply_shorts(r, R_SHORT_RXREADY_START);
            break;
        case NRF54L_RADIO_STATE_TXIDLE:
            nrf54l_radio_fire_event(r, &r->evt_ready,   INT_READY,   PUB_READY);
            nrf54l_radio_fire_event(r, &r->evt_txready, INT_TXREADY, PUB_TXREADY);
            nrf54l_radio_apply_shorts(r, R_SHORT_READY_START);
            nrf54l_radio_apply_shorts(r, R_SHORT_TXREADY_START);
            break;
        case NRF54L_RADIO_STATE_DISABLED:
            nrf54l_radio_fire_event(r, &r->evt_disabled, INT_DISABLED, PUB_DISABLED);
            nrf54l_radio_apply_shorts(r, R_SHORT_DISABLED_TXEN);
            nrf54l_radio_apply_shorts(r, R_SHORT_DISABLED_RXEN);
            break;
        default: break;
    }
}

static void nrf54l_radio_trigger_task(nrf54l_radio_state_t *r, uint32_t task_off) {
    /* Recursion guard.  Each task can synchronously fire SHORTS or
     * DPPI publishes that trigger more tasks.  Real hardware spaces
     * these out by µs of ramp-up / transmit / disable time; csim
     * fires them all in the same cycle, so without a depth limit
     * we burn into infinite cycles after the first PHYEND. */
    static int depth = 0;
    if (depth >= 8) return;
    depth++;
    if (nrf54l_radio_trace_active(r)) {
        fprintf(stderr, "[radio cpu=0x%04x cyc=%lld TASK   %-10s state=%s]\n",
                (unsigned)((uintptr_t)&r->plat->cpu & 0xFFFF),
                (long long)r->plat->cpu.cycles,
                nrf54l_radio_task_name(task_off),
                nrf54l_radio_state_name(r->state));
    }
    switch (task_off) {
        case R_TASKS_TXEN:
            /* DPPI fans TXEN out the same way it does START — multiple
             * subscribers fire in one cycle. Dedup so a second TXEN in
             * the same cycle doesn't clobber a state the firmware just
             * settled (e.g. DISABLED post-PHYEND_DISABLE). */
            if (r->plat->cpu.cycles == r->last_txen_cycle)
                break;
            r->last_txen_cycle = r->plat->cpu.cycles;
            /* Arm BEFORE set_state — set_state fires READY/TXREADY → can
             * synchronously trigger TASKS_START via shorts, which must
             * see tx_armed=1 to actually emit. */
            r->tx_armed = 1;
            if (r->state != NRF54L_RADIO_STATE_TX &&
                r->state != NRF54L_RADIO_STATE_TXRU)
                nrf54l_radio_set_state(r, NRF54L_RADIO_STATE_TXIDLE);
            break;
        case R_TASKS_RXEN:
            if (r->plat->cpu.cycles == r->last_rxen_cycle)
                break;
            r->last_rxen_cycle = r->plat->cpu.cycles;
            if (r->state != NRF54L_RADIO_STATE_RX &&
                r->state != NRF54L_RADIO_STATE_RXRU)
                nrf54l_radio_set_state(r, NRF54L_RADIO_STATE_RXIDLE);
            break;
        case R_TASKS_START:
            if (r->state == NRF54L_RADIO_STATE_TXIDLE && r->tx_armed &&
                r->plat->cpu.cycles != r->last_tx_emit_cycle) {
                arm_cpu_t *cpu = &r->plat->cpu;
                r->tx_armed = 0;
                r->last_tx_emit_cycle = cpu->cycles;
                r->state = NRF54L_RADIO_STATE_TX;
                /* Defer PHYEND by a small fixed delay — just enough for
                 * the driver's TX-setup critical section to exit and
                 * re-enable the RADIO IRQ in NVIC.  Using the full
                 * on-air duration (preamble+SFD+PHR+payload+FCS) * 32 µs
                 * would more closely match real hardware, but the
                 * multinode harness delivers bytes between nodes at
                 * synchronous (tx-start-anchored) timestamps — so a
                 * full-air-time defer leaves Node A's radio still in TX
                 * state when Node B's ACK arrives.  100 µs is well
                 * above the driver's typical critical-section length
                 * and well below the 192 µs ACK turnaround. */
                int64_t air_dur_ns = 100000LL;
                nrf54l_radio_emit_tx(r);
                nrf54l_radio_fire_event(r, &r->evt_address,    INT_ADDRESS,    PUB_ADDRESS);
                nrf54l_radio_fire_event(r, &r->evt_framestart, INT_FRAMESTART, PUB_FRAMESTART);
                /* Defer PAYLOAD/END/PHYEND + state→TXIDLE + END/PHYEND
                 * shorts to actual air-time end.  See the tx_end_event
                 * comment in the header for why this matters. */
                if (r->tx_end_scheduled)
                    arm_cancel_event(cpu, &r->tx_end_event);
                r->tx_end_event.callback  = nrf54l_radio_tx_end_cb;
                r->tx_end_event.user_data = r;
                r->tx_end_scheduled = 1;
                int64_t now_ns = arm_cycles_to_ns(cpu->cycles, cpu->cpu_freq_hz);
                arm_schedule_event_ns(cpu, &r->tx_end_event, now_ns + air_dur_ns);
            } else if (r->state == NRF54L_RADIO_STATE_RXIDLE) {
                r->state    = NRF54L_RADIO_STATE_RX;
                r->rx_phase = NRF54L_RX_WAIT_PREAMBLE;
                r->bcc_last_fired = 0;
            }
            break;
        case R_TASKS_STOP:
            if (r->state == NRF54L_RADIO_STATE_RX) r->state = NRF54L_RADIO_STATE_RXIDLE;
            if (r->state == NRF54L_RADIO_STATE_TX) r->state = NRF54L_RADIO_STATE_TXIDLE;
            break;
        case R_TASKS_DISABLE:
            /* If a frame is mid-flight on RX, defer the actual state
             * change until the parser hits end-of-frame — see the
             * rx_disable_pending comment in the header. Anything else
             * disables immediately. */
            if (r->state == NRF54L_RADIO_STATE_RX &&
                r->rx_phase != NRF54L_RX_WAIT_PREAMBLE &&
                r->rx_phase != NRF54L_RX_WAIT_SFD) {
                r->rx_disable_pending = 1;
            } else {
                nrf54l_radio_set_state(r, NRF54L_RADIO_STATE_DISABLED);
            }
            break;
        case R_TASKS_CCASTART:
            /* No interference model — always idle. */
            nrf54l_radio_fire_event(r, &r->evt_ccaidle, INT_CCAIDLE, PUB_CCAIDLE);
            nrf54l_radio_apply_shorts(r, R_SHORT_CCAIDLE_TXEN);
            nrf54l_radio_apply_shorts(r, R_SHORT_CCAIDLE_STOP);
            break;
        case R_TASKS_RSSISTART:
        case R_TASKS_EDSTART:
            nrf54l_radio_fire_event(r, &r->evt_edend, INT_EDEND, PUB_EDEND);
            break;
        default: break;
    }
    depth--;
}

/* DPPI subscriber callback — bound once per SUBSCRIBE slot. */
static void radio_sub_cb(void *user) {
    radio_sub_binding_t *b = (radio_sub_binding_t *)user;
    nrf54l_radio_trigger_task(b->radio, b->task_off);
}

