nvt/cooja-ng/src/arm/nrf54l15_soc.c
/* Fired (frame_air_dur) ns after TASKS_START — see the tx_end_event
 * field comment in the header.  Handles the END / PHYEND firing and
 * the TX→TXIDLE→(DISABLED) state dance that used to be inline in
 * R_TASKS_START.  Real hardware fires PHYEND at on-air completion;
 * doing the same here gives the driver's TX setup (still inside its
 * NVIC-disabling critical section when emit_tx ran) time to finish
 * and re-enable the RADIO IRQ before PHYEND triggers it. */
static void nrf54l_radio_tx_end_cb(void *user, arm_event_t *ev) {
    (void)ev;
    nrf54l_radio_state_t *r = (nrf54l_radio_state_t *)user;
    r->tx_end_scheduled = 0;
    /* Clear tx_armed before applying END_START / PHYEND_START shorts —
     * those trigger TASKS_START, and we must not let a stale tx_armed
     * (from some TXEN that fired while the TX was in flight) re-emit
     * the same frame.  Real HW edge-triggers the START off TXREADY,
     * not off END/PHYEND; chained TX needs a fresh TXREADY cycle. */
    r->tx_armed = 0;
    nrf54l_radio_fire_event(r, &r->evt_payload, INT_PAYLOAD, PUB_PAYLOAD);
    nrf54l_radio_fire_event(r, &r->evt_end,     INT_END,     PUB_END);
    nrf54l_radio_fire_event(r, &r->evt_phyend,  INT_PHYEND,  PUB_PHYEND);
    r->state = NRF54L_RADIO_STATE_TXIDLE;
    nrf54l_radio_apply_shorts(r, R_SHORT_END_START);
    nrf54l_radio_apply_shorts(r, R_SHORT_PHYEND_START);
    nrf54l_radio_apply_shorts(r, R_SHORT_PHYEND_DISABLE);
}

/* Emit the on-air byte sequence from PACKETPTR.  Body lives in
 * nrf_radio_common — shared with nrf52840 RADIO. */
static void nrf54l_radio_emit_tx(nrf54l_radio_state_t *r) {
    nrf_radio_emit_ieee802154_frame(&r->plat->cpu, r->packetptr,
                                     r->tx_cb, r->tx_user);
}

void nrf54l_radio_set_tx_listener(nrf54l15_soc_t *soc,
                                   nrf54l_radio_tx_listener_t cb, void *user) {
    soc->radio.tx_cb   = cb;
    soc->radio.tx_user = user;
}

void nrf54l_radio_receive_byte(nrf54l15_soc_t *soc, uint8_t byte) {
    nrf54l_radio_state_t *r = &soc->radio;
    if (r->state != NRF54L_RADIO_STATE_RX) {
        if (nrf54l_radio_trace_active(r) || getenv("NRF54L_RX_DROP_TRACE"))
            fprintf(stderr, "[radio cpu=0x%04x cyc=%lld RX_DROP state=%s byte=0x%02x]\n",
                    (unsigned)((uintptr_t)&r->plat->cpu & 0xFFFF),
                    (long long)r->plat->cpu.cycles,
                    nrf54l_radio_state_name(r->state), byte);
        return;
    }
    if (nrf54l_radio_trace_active(r) && byte != 0x00 &&
        r->rx_phase == NRF54L_RX_WAIT_PREAMBLE)
        fprintf(stderr, "[radio cpu=0x%04x cyc=%lld RX_BYTE state=%s phase=%d byte=0x%02x]\n",
                (unsigned)((uintptr_t)&r->plat->cpu & 0xFFFF),
                (long long)r->plat->cpu.cycles,
                nrf54l_radio_state_name(r->state), r->rx_phase, byte);
    arm_cpu_t *cpu = &r->plat->cpu;
    if (r->packetptr < cpu->sram_base || r->packetptr + 128 > cpu->sram_end)
        return;
    switch (r->rx_phase) {
        case NRF54L_RX_WAIT_PREAMBLE:
            if (byte == IEEE802154_PREAMBLE_BYTE)
                r->rx_phase = NRF54L_RX_WAIT_SFD;
            break;
        case NRF54L_RX_WAIT_SFD:
            if (byte == IEEE802154_SFD) {
                r->rx_phase = NRF54L_RX_READ_PHR;
                nrf54l_radio_fire_event(r, &r->evt_address,    INT_ADDRESS,    PUB_ADDRESS);
                nrf54l_radio_fire_event(r, &r->evt_framestart, INT_FRAMESTART, PUB_FRAMESTART);
            } else if (byte != IEEE802154_PREAMBLE_BYTE) {
                r->rx_phase = NRF54L_RX_WAIT_PREAMBLE;
            }
            break;
        case NRF54L_RX_READ_PHR:
            if (byte < 2 || byte > 127) {
                r->rx_phase = NRF54L_RX_WAIT_PREAMBLE;
                break;
            }
            arm_write8(cpu, r->packetptr, byte);
            r->rx_remaining = byte;
            r->rx_offset    = 1;
            r->rx_phase     = NRF54L_RX_READ_PAYLOAD;
            /* nrf_802154 typically programs BCC=8 (after FRAMESTART) so it
             * gets a BCMATCH the moment PHR is in the buffer. The check
             * lives both here and in READ_PAYLOAD so the milestone fires
             * at the exact rx_offset the driver expects (1 = PHR boundary,
             * higher = subsequent header milestones the IRQ re-arms for).
             * `bcc_last_fired` suppresses re-fires for the same BCC value
             * while leaving `r->bcc` intact for firmware read-back. */
            if (r->bcc != 0 && r->bcc != r->bcc_last_fired &&
                (uint32_t)(r->rx_offset * 8) >= r->bcc) {
                r->bcc_last_fired = r->bcc;
                nrf54l_radio_fire_event(r, &r->evt_bcmatch, INT_BCMATCH, PUB_BCMATCH);
            }
            break;
        case NRF54L_RX_READ_PAYLOAD:
            arm_write8(cpu, r->packetptr + (uint32_t)r->rx_offset, byte);
            r->rx_offset++;
            r->rx_remaining--;
            /* BCMATCH fires when BCC bits have been received.  BCC is in
             * bits and the Nordic 802154 driver programs successive
             * milestones (e.g. PHR + FCF + DST + ...) to inspect headers
             * as bytes arrive. Use `bcc_last_fired` instead of clearing
             * `r->bcc` so the driver can still read it via the BCC
             * register in its IRQ handler. */
            if (r->bcc != 0 && r->bcc != r->bcc_last_fired &&
                (uint32_t)(r->rx_offset * 8) >= r->bcc) {
                r->bcc_last_fired = r->bcc;
                nrf54l_radio_fire_event(r, &r->evt_bcmatch, INT_BCMATCH, PUB_BCMATCH);
            }
            if (r->rx_remaining == 0) {
                nrf54l_radio_fire_event(r, &r->evt_payload,  INT_PAYLOAD,  PUB_PAYLOAD);
                nrf54l_radio_fire_event(r, &r->evt_end,      INT_END,      PUB_END);
                nrf54l_radio_fire_event(r, &r->evt_phyend,   INT_PHYEND,   PUB_PHYEND);
                nrf54l_radio_fire_event(r, &r->evt_crcok,    INT_CRCOK,    PUB_CRCOK);

                /* No hardware-style auto-ACK: the Nordic 802.15.4 driver
                 * schedules its own ACK via TIMER+PPI in response to
                 * CRCOK with AR bit set, and now that emit_tx defers
                 * PHYEND to actual air-time end the driver has time to
                 * exit its critical section and arm the ACK on time.
                 * Emitting one from the chip too produces a duplicate
                 * ACK frame at the sender. */
                r->state    = NRF54L_RADIO_STATE_RXIDLE;
                r->rx_phase = NRF54L_RX_WAIT_PREAMBLE;
                nrf54l_radio_apply_shorts(r, R_SHORT_END_START);
                nrf54l_radio_apply_shorts(r, R_SHORT_PHYEND_DISABLE);
                if (r->rx_disable_pending) {
                    r->rx_disable_pending = 0;
                    nrf54l_radio_set_state(r, NRF54L_RADIO_STATE_DISABLED);
                }
            }
            break;
    }
}

static int nrf54l_radio_read(void *user_data, uint32_t addr) {
    nrf54l_radio_state_t *r = (nrf54l_radio_state_t *)user_data;
    uint32_t off = addr - NRF54L_RADIO_BASE;
    if (off >= R_SUBSCRIBE_BASE && off < R_SUBSCRIBE_END)
        return (int)r->subscribe[R_SUBSCRIBE_INDEX(off)];
    if (off >= R_PUBLISH_BASE && off < R_PUBLISH_END)
        return (int)r->publish[(off - R_PUBLISH_BASE) / 4];
    switch (off) {
        case R_EVENTS_READY:        return (int)r->evt_ready;
        case R_EVENTS_TXREADY:      return (int)r->evt_txready;
        case R_EVENTS_RXREADY:      return (int)r->evt_rxready;
        case R_EVENTS_ADDRESS:      return (int)r->evt_address;
        case R_EVENTS_FRAMESTART:   return (int)r->evt_framestart;
        case R_EVENTS_PAYLOAD:      return (int)r->evt_payload;
        case R_EVENTS_END:          return (int)r->evt_end;
        case R_EVENTS_PHYEND:       return (int)r->evt_phyend;
        case R_EVENTS_DISABLED:     return (int)r->evt_disabled;
        case R_EVENTS_DEVMATCH:     return (int)r->evt_devmatch;
        case R_EVENTS_DEVMISS:      return (int)r->evt_devmiss;
        case R_EVENTS_CRCOK:        return (int)r->evt_crcok;
        case R_EVENTS_CRCERROR:     return (int)r->evt_crcerror;
        case R_EVENTS_BCMATCH:      return (int)r->evt_bcmatch;
        case R_EVENTS_EDEND:        return (int)r->evt_edend;
        case R_EVENTS_CCAIDLE:      return (int)r->evt_ccaidle;
        case R_EVENTS_CCABUSY:      return (int)r->evt_ccabusy;
        case R_SHORTS:              return (int)r->shorts;
        case R_INTENSET00:
        case R_INTENCLR00:          return (int)r->intenset00;
        case R_INTENSET10:
        case R_INTENCLR10:          return (int)r->intenset10;
        case R_MODE:                return (int)r->mode;
        case R_STATE:               return (int)r->state;
        case R_FREQUENCY:           return (int)r->frequency;
        case R_TXPOWER:             return (int)r->txpower;
        case R_TIMING:              return (int)r->timing;
        case R_PCNF0:               return (int)r->pcnf0;
        case R_PCNF1:               return (int)r->pcnf1;
        case R_CRCCNF:              return (int)r->crccnf;
        case R_CRCPOLY:             return (int)r->crcpoly;
        case R_CRCINIT:             return (int)r->crcinit;
        case R_PACKETPTR:           return (int)r->packetptr;
        case R_BCC:                 return (int)r->bcc;
        case R_CRCSTATUS:           return 1;     /* always CRC OK */
        case R_RXMATCH:             return 0;
        default:                    return 0;
    }
}

