nvt/cooja-ng/src/arm/nrf54l15_soc.c
static void nrf54l_radio_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf54l_radio_state_t *r = (nrf54l_radio_state_t *)user_data;
    uint32_t off = addr - NRF54L_RADIO_BASE;

    /* Tasks: trigger on write of 1. */
    if (off <= R_TASKS_CCASTOP) {
        if (value == 1) nrf54l_radio_trigger_task(r, off);
        return;
    }

    /* SUBSCRIBE — bind/unbind DPPI channel. */
    if (off >= R_SUBSCRIBE_BASE && off < R_SUBSCRIBE_END) {
        int idx = R_SUBSCRIBE_INDEX(off);
        if (getenv("NRF54L_RADIO_TASK_TRACE") && (value & 0x80000000u)) {
            const char *names[] = {
                "TXEN","RXEN","START","STOP","DISABLE","RSSISTART",
                "BCSTART","BCSTOP","EDSTART","EDSTOP","CCASTART","CCASTOP"
            };
            fprintf(stderr, "[radio SUBSCRIBE_%s = ch%d cyc=%lld]\n",
                    idx < 12 ? names[idx] : "?", value & 0x1F,
                    (long long)r->plat->cpu.cycles);
        }
        r->subscribe[idx] = value;
        /* Unbind previous channel if any. */
        if (r->sub_channel[idx] >= 0) {
            nrf54l_dppi_unsubscribe(r->dppi, r->sub_channel[idx],
                                     radio_sub_cb, &radio_sub_bindings[idx]);
            r->sub_channel[idx] = -1;
        }
        /* Bind new channel if EN set. */
        if (value & 0x80000000u) {
            int ch = (int)(value & 0x1Fu);
            radio_sub_bindings[idx].radio    = r;
            radio_sub_bindings[idx].task_off = radio_sub_task_off[idx];
            nrf54l_dppi_subscribe(r->dppi, ch,
                                   radio_sub_cb, &radio_sub_bindings[idx]);
            r->sub_channel[idx] = ch;
        }
        return;
    }

    /* PUBLISH — just store; we publish on event-fire by looking up. */
    if (off >= R_PUBLISH_BASE && off < R_PUBLISH_END) {
        int idx = (off - R_PUBLISH_BASE) / 4;
        r->publish[idx] = value;
        return;
    }

    /* EVENTS — firmware writes 0 to ack. */
    switch (off) {
        case R_EVENTS_READY:        r->evt_ready      = value & 1; return;
        case R_EVENTS_TXREADY:      r->evt_txready    = value & 1; return;
        case R_EVENTS_RXREADY:      r->evt_rxready    = value & 1; return;
        case R_EVENTS_ADDRESS:      r->evt_address    = value & 1; return;
        case R_EVENTS_FRAMESTART:   r->evt_framestart = value & 1; return;
        case R_EVENTS_PAYLOAD:      r->evt_payload    = value & 1; return;
        case R_EVENTS_END:          r->evt_end        = value & 1; return;
        case R_EVENTS_PHYEND:       r->evt_phyend     = value & 1; return;
        case R_EVENTS_DISABLED:     r->evt_disabled   = value & 1; return;
        case R_EVENTS_DEVMATCH:     r->evt_devmatch   = value & 1; return;
        case R_EVENTS_DEVMISS:      r->evt_devmiss    = value & 1; return;
        case R_EVENTS_CRCOK:        r->evt_crcok      = value & 1; return;
        case R_EVENTS_CRCERROR:     r->evt_crcerror   = value & 1; return;
        case R_EVENTS_BCMATCH:      r->evt_bcmatch    = value & 1; return;
        case R_EVENTS_EDEND:        r->evt_edend      = value & 1; return;
        case R_EVENTS_CCAIDLE:      r->evt_ccaidle    = value & 1; return;
        case R_EVENTS_CCABUSY:      r->evt_ccabusy    = value & 1; return;

        case R_SHORTS:              r->shorts       = value; return;
        case R_INTENSET00:
            r->intenset00 |= value;
            if (nrf54l_radio_trace_active(r))
                fprintf(stderr, "[radio cpu=0x%04x cyc=%lld INTSET00 +0x%x => 0x%x state=%s]\n",
                        (unsigned)((uintptr_t)&r->plat->cpu & 0xFFFF),
                        (long long)r->plat->cpu.cycles, value, r->intenset00,
                        nrf54l_radio_state_name(r->state));
            return;
        case R_INTENCLR00:
            r->intenset00 &= ~value;
            if (nrf54l_radio_trace_active(r))
                fprintf(stderr, "[radio cpu=0x%04x cyc=%lld INTCLR00 -0x%x => 0x%x state=%s]\n",
                        (unsigned)((uintptr_t)&r->plat->cpu & 0xFFFF),
                        (long long)r->plat->cpu.cycles, value, r->intenset00,
                        nrf54l_radio_state_name(r->state));
            return;
        case R_INTENSET10:          r->intenset10  |= value; return;
        case R_INTENCLR10:          r->intenset10 &= ~value; return;
        case R_MODE:                r->mode      = value;    return;
        case R_FREQUENCY:           r->frequency = value;    return;
        case R_TXPOWER:             r->txpower   = value;    return;
        case R_TIMING:              r->timing    = value;    return;
        case R_PCNF0:               r->pcnf0     = value;    return;
        case R_PCNF1:               r->pcnf1     = value;    return;
        case R_CRCCNF:              r->crccnf    = value;    return;
        case R_CRCPOLY:             r->crcpoly   = value;    return;
        case R_CRCINIT:             r->crcinit   = value;    return;
        case R_PACKETPTR:           r->packetptr = value;    return;
        case R_BCC:           r->bcc       = value;    return;
        default: return;
    }
}
/* ============================================================
 * TIMER (TIMER00/10/20/21/22/23/24)
 *
 * Minimal model targeting the nrf_802154 lptimer backend, which uses
 * TIMER20 at 1 MHz in Timer mode and reads CC[0] via TASKS_CAPTURE[0].
 * We back the counter with sim_time_ns; compare matches schedule a CPU
 * event that fires EVENTS_COMPARE[n], optionally publishing on DPPI.
 *
 * Register layout (from SVD, derived from GLOBAL_TIMER00_NS):
 *   0x000 TASKS_START   0x004 STOP   0x008 COUNT   0x00C CLEAR
 *   0x040+4n  TASKS_CAPTURE[n]
 *   0x080+4n  SUBSCRIBE_<START/STOP/COUNT/CLEAR>
 *   0x0C0+4n  SUBSCRIBE_CAPTURE[n]
 *   0x140+4n  EVENTS_COMPARE[n]
 *   0x1C0+4n  PUBLISH_COMPARE[n]
 *   0x200     SHORTS
 *   0x300/304/308  INTEN/INTENSET/INTENCLR
 *   0x504 MODE   0x508 BITMODE   0x510 PRESCALER
 *   0x540+4n  CC[n]
 * ============================================================ */
#define NRF54L_TIMER10_BASE  0x50085000u
#define NRF54L_TIMER20_BASE  0x500CA000u
#define NRF54L_TIMER_SIZE    0x1000u

