nvt/cooja-ng/src/arm/nrf54l15_soc.c
/* IRQ numbers from SVD interrupts blocks (nrf54l15_application.svd). */
#define NRF54L_TIMER10_IRQ   133
#define NRF54L_TIMER20_IRQ   164

/* Base TIMER clock on nrf54l15 is 16 MHz; PRESCALER divides by 2^PRESCALER. */
#define NRF54L_TIMER_BASE_HZ  16000000u

static inline uint64_t nrf54l_timer_tick_ns(nrf54l_timer_state_t *t) {
    uint32_t pres = t->prescaler & 0xF;
    /* tick_ns = 1e9 / (16e6 / 2^pres) = (1<<pres) * 1000 / 16 */
    return ((uint64_t)(1u << pres) * 1000u) / 16u;
}

static inline uint32_t nrf54l_timer_mask(nrf54l_timer_state_t *t) {
    switch (t->bitmode & 3) {
        case 0: return 0x0000FFFFu;  /* 16-bit */
        case 1: return 0x000000FFu;  /* 8-bit  */
        case 2: return 0x00FFFFFFu;  /* 24-bit */
        default: return 0xFFFFFFFFu; /* 32-bit */
    }
}

/* Live "now" in ns from CPU cycles — same rationale as GRTC: a busy-wait
 * inside the firmware (e.g. nrf_802154_time_get + wait_for_flag) calls
 * this from within an arm_step batch; reading cpu.sim_time_ns would see
 * the value frozen at the start of the step, so the deadline never
 * advances and the busy-wait spins until the wall-clock timeout. */
static inline int64_t nrf54l_timer_now_ns(nrf54l_timer_state_t *t) {
    arm_cpu_t *cpu = &t->plat->cpu;
    return arm_cycles_to_ns(cpu->cycles, cpu->cpu_freq_hz);
}

static uint32_t nrf54l_timer_counter_now(nrf54l_timer_state_t *t) {
    if (!t->running) return t->snapshot & nrf54l_timer_mask(t);
    int64_t now = nrf54l_timer_now_ns(t);
    uint64_t tn = nrf54l_timer_tick_ns(t);
    if (tn == 0) return 0;
    uint64_t ticks = (uint64_t)(now - t->t0_ns) / tn + t->snapshot;
    return (uint32_t)(ticks & nrf54l_timer_mask(t));
}

static void nrf54l_timer_compare_fired(void *user, cpu_event_t *ev) {
    (void)ev;
    struct { nrf54l_timer_state_t *t; int n; } *ctx = user;
    nrf54l_timer_state_t *t = ctx->t;
    int n = ctx->n;
    t->events_compare[n] = 1;
    int irq_fired = (t->inten & (1u << (16 + n))) && t->irq_num >= 0;
    if (irq_fired)
        arm_nvic_set_pending(&t->plat->nvic, t->irq_num);
    uint32_t pub = t->publish_compare[n];
    int published = ((pub & 0x80000000u) && t->dppi);
    if (published)
        nrf54l_dppi_publish(t->dppi, (int)(pub & 0x1Fu));
    if (getenv("NRF54L_TIMER_TRACE")) {
        fprintf(stderr, "[timer cpu=0x%04x cyc=%lld base=0x%x CC[%d]=%u irq=%d pub=0x%x]\n",
                (unsigned)((uintptr_t)&t->plat->cpu & 0xFFFF),
                (long long)t->plat->cpu.cycles,
                t->base_addr, n, t->cc[n], irq_fired, pub);
    }
    /* SHORTS: COMPARE_CLEAR (bit n), COMPARE_STOP (bit 8+n). */
    if (t->shorts & (1u << n)) {
        t->snapshot = 0;
        t->t0_ns = nrf54l_timer_now_ns(t);
    }
    if (t->shorts & (1u << (8 + n))) {
        if (t->running) t->snapshot = nrf54l_timer_counter_now(t);
        t->running = false;
    }
}

/* Per-CC firing context lives in the event's user pointer. */
static struct timer_cc_ctx { nrf54l_timer_state_t *t; int n; }
    timer_cc_ctx[2 /* timers */][NRF54L_TIMER_NUM_CC];

static void nrf54l_timer_schedule_cc(nrf54l_timer_state_t *t, int n) {
    arm_cancel_event(&t->plat->cpu, &t->ev_compare[n]);
    if (!t->running) return;
    /* Skip CCs that the firmware hasn't programmed (CC=0 with no INTEN
     * and no PUBLISH wired up).  Spurious fires waste cycles and confuse
     * the driver. */
    bool inten   = (t->inten & (1u << (16 + n))) != 0;
    bool publish = (t->publish_compare[n] & 0x80000000u) != 0;
    bool shorts  = (t->shorts & ((1u << n) | (1u << (8 + n)))) != 0;
    if (!inten && !publish && !shorts) return;
    uint32_t now = nrf54l_timer_counter_now(t);
    uint32_t target = t->cc[n] & nrf54l_timer_mask(t);
    uint32_t delta = (target - now) & nrf54l_timer_mask(t);
    if (delta == 0) delta = nrf54l_timer_mask(t) + 1u;  /* full wrap */
    uint64_t tn = nrf54l_timer_tick_ns(t);
    int64_t fire_ns = nrf54l_timer_now_ns(t) + (int64_t)(delta * tn);
    arm_schedule_event_ns(&t->plat->cpu, &t->ev_compare[n], fire_ns);
}

static void nrf54l_timer_capture(nrf54l_timer_state_t *t, int n) {
    if (n < 0 || n >= NRF54L_TIMER_NUM_CC) return;
    t->cc[n] = nrf54l_timer_counter_now(t);
}

static void nrf54l_timer_task(nrf54l_timer_state_t *t, uint32_t off) {
    switch (off) {
        case 0x000: /* START */
            if (!t->running) {
                t->t0_ns   = nrf54l_timer_now_ns(t);
                t->running = true;
                for (int n = 0; n < NRF54L_TIMER_NUM_CC; n++)
                    nrf54l_timer_schedule_cc(t, n);
            }
            break;
        case 0x004: /* STOP */
            if (t->running) {
                t->snapshot = nrf54l_timer_counter_now(t);
                t->running  = false;
            }
            for (int n = 0; n < NRF54L_TIMER_NUM_CC; n++)
                arm_cancel_event(&t->plat->cpu, &t->ev_compare[n]);
            break;
        case 0x008: /* COUNT */
            if (t->mode == 1 /* Counter */ || t->mode == 2 /* LowPowerCounter */) {
                t->counter = (t->counter + 1) & nrf54l_timer_mask(t);
                for (int n = 0; n < NRF54L_TIMER_NUM_CC; n++) {
                    if (t->counter == (t->cc[n] & nrf54l_timer_mask(t)))
                        nrf54l_timer_compare_fired(
                            (void *)&timer_cc_ctx[t->base_addr == NRF54L_TIMER10_BASE ? 0 : 1][n],
                            NULL);
                }
            }
            break;
        case 0x00C: /* CLEAR */
            t->snapshot = 0;
            t->t0_ns    = nrf54l_timer_now_ns(t);
            t->counter  = 0;
            for (int n = 0; n < NRF54L_TIMER_NUM_CC; n++)
                if (t->running) nrf54l_timer_schedule_cc(t, n);
            break;
        default:
            if (off >= 0x040 && off < 0x040 + 4 * NRF54L_TIMER_NUM_CC)
                nrf54l_timer_capture(t, (off - 0x040) / 4);
            break;
    }
}

static void timer_capture_sub_cb(void *user) {
    struct timer_cc_ctx *ctx = (struct timer_cc_ctx *)user;
    nrf54l_timer_capture(ctx->t, ctx->n);
}
static void timer_start_sub_cb(void *user) {
    nrf54l_timer_task((nrf54l_timer_state_t *)user, 0x000);
}
static void timer_stop_sub_cb(void *user) {
    nrf54l_timer_task((nrf54l_timer_state_t *)user, 0x004);
}
static void timer_clear_sub_cb(void *user) {
    nrf54l_timer_task((nrf54l_timer_state_t *)user, 0x00C);
}
static void timer_count_sub_cb(void *user) {
    nrf54l_timer_task((nrf54l_timer_state_t *)user, 0x008);
}

static int nrf54l_timer_read(void *user_data, uint32_t addr) {
    nrf54l_timer_state_t *t = (nrf54l_timer_state_t *)user_data;
    uint32_t off = addr & 0xFFFu;
    if (off >= 0x140 && off < 0x140 + 4 * NRF54L_TIMER_NUM_CC)
        return (int)t->events_compare[(off - 0x140) / 4];
    if (off >= 0x1C0 && off < 0x1C0 + 4 * NRF54L_TIMER_NUM_CC)
        return (int)t->publish_compare[(off - 0x1C0) / 4];
    if (off >= 0x540 && off < 0x540 + 4 * NRF54L_TIMER_NUM_CC)
        return (int)t->cc[(off - 0x540) / 4];
    if (off >= 0x0C0 && off < 0x0C0 + 4 * NRF54L_TIMER_NUM_CC)
        return (int)t->subscribe_capture[(off - 0x0C0) / 4];
    switch (off) {
        case 0x080: return (int)t->subscribe_start;
        case 0x084: return (int)t->subscribe_stop;
        case 0x088: return (int)t->subscribe_count;
        case 0x08C: return (int)t->subscribe_clear;
        case 0x200: return (int)t->shorts;
        case 0x300:
        case 0x304:
        case 0x308: return (int)t->inten;
        case 0x504: return (int)t->mode;
        case 0x508: return (int)t->bitmode;
        case 0x510: return (int)t->prescaler;
        default:    return 0;
    }
}

static void nrf54l_timer_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf54l_timer_state_t *t = (nrf54l_timer_state_t *)user_data;
    uint32_t off = addr & 0xFFFu;
    if (getenv("NRF54L_TIMER_TRACE")) {
        const char *kind;
        if (off < 0x80) kind = "TASK";
        else if (off >= 0x140 && off < 0x180) kind = "EVENTS_COMPARE";
        else if (off >= 0x540 && off < 0x560) kind = "CC";
        else if (off == 0x510) kind = "PRESCALER";
        else if (off == 0x508) kind = "BITMODE";
        else if (off == 0x504) kind = "MODE";
        else if (off == 0x200) kind = "SHORTS";
        else if (off >= 0x300 && off <= 0x308) kind = "INTEN*";
        else kind = "other";
        fprintf(stderr, "[timerW cpu=0x%04x cyc=%lld base=0x%x off=0x%x val=0x%x (%s)]\n",
                (unsigned)((uintptr_t)&t->plat->cpu & 0xFFFF),
                (long long)t->plat->cpu.cycles,
                t->base_addr, off, value, kind);
    }
    /* Tasks region. */
    if (off < 0x080) {
        if (value == 1) nrf54l_timer_task(t, off);
        return;
    }
    /* SUBSCRIBE for START/STOP/COUNT/CLEAR. */
    if (off >= 0x080 && off <= 0x08C) {
        nrf54l_dppi_sub_cb cb = NULL;
        switch (off) {
            case 0x080: t->subscribe_start = value; cb = timer_start_sub_cb; break;
            case 0x084: t->subscribe_stop  = value; cb = timer_stop_sub_cb;  break;
            case 0x088: t->subscribe_count = value; cb = timer_count_sub_cb; break;
            case 0x08C: t->subscribe_clear = value; cb = timer_clear_sub_cb; break;
        }
        if ((value & 0x80000000u) && t->dppi)
            nrf54l_dppi_subscribe(t->dppi, (int)(value & 0x1Fu), cb, t);
        return;
    }
    if (off >= 0x0C0 && off < 0x0C0 + 4 * NRF54L_TIMER_NUM_CC) {
        int n = (off - 0x0C0) / 4;
        if (t->sub_capture_ch[n] >= 0)
            nrf54l_dppi_unsubscribe(t->dppi, t->sub_capture_ch[n],
                                     timer_capture_sub_cb,
                                     &timer_cc_ctx[t->base_addr == NRF54L_TIMER10_BASE ? 0 : 1][n]);
        t->subscribe_capture[n] = value;
        t->sub_capture_ch[n] = -1;
        if ((value & 0x80000000u) && t->dppi) {
            int ch = (int)(value & 0x1Fu);
            t->sub_capture_ch[n] = ch;
            nrf54l_dppi_subscribe(t->dppi, ch, timer_capture_sub_cb,
                                   &timer_cc_ctx[t->base_addr == NRF54L_TIMER10_BASE ? 0 : 1][n]);
        }
        return;
    }
    if (off >= 0x140 && off < 0x140 + 4 * NRF54L_TIMER_NUM_CC) {
        t->events_compare[(off - 0x140) / 4] = value & 1;
        return;
    }
    if (off >= 0x1C0 && off < 0x1C0 + 4 * NRF54L_TIMER_NUM_CC) {
        int n = (off - 0x1C0) / 4;
        t->publish_compare[n] = value;
        if (t->running) nrf54l_timer_schedule_cc(t, n);
        return;
    }
    if (off >= 0x540 && off < 0x540 + 4 * NRF54L_TIMER_NUM_CC) {
        int n = (off - 0x540) / 4;
        t->cc[n] = value;
        if (t->running) nrf54l_timer_schedule_cc(t, n);
        return;
    }
    switch (off) {
        case 0x200: t->shorts = value;
                    if (t->running)
                        for (int n=0; n<NRF54L_TIMER_NUM_CC; n++) nrf54l_timer_schedule_cc(t, n);
                    return;
        case 0x300: t->inten  = value;
                    if (t->running)
                        for (int n=0; n<NRF54L_TIMER_NUM_CC; n++) nrf54l_timer_schedule_cc(t, n);
                    return;
        case 0x304: t->inten |= value;
                    if (t->running)
                        for (int n=0; n<NRF54L_TIMER_NUM_CC; n++) nrf54l_timer_schedule_cc(t, n);
                    return;
        case 0x308: t->inten &= ~value; return;
        case 0x504: t->mode   = value; return;
        case 0x508:
            t->bitmode = value;
            return;
        case 0x510:
            t->prescaler = value & 0xF;
            return;
        default: return;
    }
}

static void nrf54l_timer_setup(nrf54l_timer_state_t *t, arm_platform_t *plat,
                                nrf54l_dppi_state_t *dppi, uint32_t base,
                                int irq_num, int slot) {
    t->plat      = plat;
    t->dppi      = dppi;
    t->irq_num   = irq_num;
    t->base_addr = base;
    t->bitmode   = 0; /* 16-bit default per SVD */
    for (int n = 0; n < NRF54L_TIMER_NUM_CC; n++) {
        t->sub_capture_ch[n] = -1;
        timer_cc_ctx[slot][n].t = t;
        timer_cc_ctx[slot][n].n = n;
        t->ev_compare[n].callback  = nrf54l_timer_compare_fired;
        t->ev_compare[n].user_data = &timer_cc_ctx[slot][n];
    }
    arm_register_io(&plat->cpu, base, NRF54L_TIMER_SIZE,
                    nrf54l_timer_read, nrf54l_timer_write, t);
}



/* ============================================================
 * SoC lifecycle
 * ============================================================ */
static void nrf54l15_soc_init(arm_platform_t *plat) {
    nrf54l15_soc_t *soc = (nrf54l15_soc_t *)calloc(1, sizeof(*soc));
    plat->soc = soc;
    soc->plat = plat;

    /* Per-board VTOR override (both DK and XIAO use 0 — no bootloader). */
    if (plat->config && plat->config->vtor_override)
        plat->cpu.vtor_default = plat->config->vtor_override;

    /* Minimum host vtable so anything reaching plat->host finds valid
     * function pointers even before peripherals are wired. */
    plat->host.cpu         = &plat->cpu;
    plat->host.gpio        = NULL;
    plat->host.now_ns      = nrf54l_host_now_ns;
    plat->host.schedule_ns = nrf54l_host_schedule_ns;
    plat->host.cancel      = nrf54l_host_cancel;

    /* GLOBAL_CLOCK — first peripheral firmware touches after reset. */
    arm_register_io(&plat->cpu,
                    NRF54L_GLOBAL_CLOCK_BASE, NRF54L_GLOBAL_CLOCK_SIZE,
                    nrf54l_global_clock_read, nrf54l_global_clock_write,
                    &soc->global_clock);

    /* FICR — INFO.DEVICEID for the link-layer EUI-64. Default to
     * 0 here; the multinode harness overwrites with per-node values
     * before populate_link_address() runs. */
    arm_register_io(&plat->cpu,
                    NRF54L_FICR_BASE, NRF54L_FICR_SIZE,
                    nrf54l_ficr_read, nrf54l_ficr_write, &soc->ficr);

