nvt/cooja-ng/src/arm/nrf54l15_soc.c
    /* UARTE20 — pure EasyDMA console. */
    soc->uarte20.plat = plat;
    arm_register_io(&plat->cpu,
                    NRF54L_UARTE20_BASE, NRF54L_UARTE20_SIZE,
                    nrf54l_uarte_read, nrf54l_uarte_write, &soc->uarte20);

    /* DPPI fabric — single 32-channel state aliased by all four
     * DPPIC base addresses (DPPIC00/10/20/30).  Subscribers register
     * via nrf54l_dppi_subscribe(); publishers call nrf54l_dppi_publish().
     * No state to initialise — channels start disabled, subs list empty. */
    for (size_t i = 0; i < sizeof(nrf54l_dppic_bases) / sizeof(nrf54l_dppic_bases[0]); i++) {
        arm_register_io(&plat->cpu,
                        nrf54l_dppic_bases[i], NRF54L_DPPIC_SIZE,
                        nrf54l_dppic_read, nrf54l_dppic_write, &soc->dppi);
    }

    /* GRTC — Contiki tick source + MPSL timeslot timer. */
    soc->grtc.plat    = plat;
    soc->grtc.dppi    = &soc->dppi;
    soc->grtc.irq_num = NRF54L_GRTC_IRQ;
    arm_register_io(&plat->cpu,
                    NRF54L_GRTC_BASE, NRF54L_GRTC_SIZE,
                    nrf54l_grtc_read, nrf54l_grtc_write, &soc->grtc);

    /* RADIO — 802.15.4 transceiver. */
    soc->radio.plat       = plat;
    soc->radio.dppi       = &soc->dppi;
    soc->radio.irq_num_0  = NRF54L_RADIO_IRQ_0;
    soc->radio.irq_num_1  = NRF54L_RADIO_IRQ_1;
    soc->radio.state      = NRF54L_RADIO_STATE_DISABLED;
    for (int i = 0; i < NRF54L_RADIO_NUM_SUBSCRIBES; i++)
        soc->radio.sub_channel[i] = -1;
    arm_register_io(&plat->cpu,
                    NRF54L_RADIO_BASE, NRF54L_RADIO_SIZE,
                    nrf54l_radio_read, nrf54l_radio_write, &soc->radio);

    /* EGU00/10/20 — software-trigger sources for the DPPI fabric.
     * EGU10 dispatches the nrf_802154 SWI handler: the driver maps
     * RADIO.EVENTS_DISABLED → DPPI → EGU10.SUBSCRIBE_TRIGGER →
     * EGU10.EVENTS_TRIGGERED → IRQ 135 → SWI_IRQHandler → rxframe
     * notification. Without an actual NVIC pending bit the SWI
     * never runs and the upper layer never sees received frames. */
    nrf54l_egu_state_t *egus[3]    = { &soc->egu00, &soc->egu10, &soc->egu20 };
    uint32_t            bases[3]   = { NRF54L_EGU00_BASE, NRF54L_EGU10_BASE, NRF54L_EGU20_BASE };
    int                 irqs[3]    = { -1, NRF54L_EGU10_IRQ, -1 };
    for (int i = 0; i < 3; i++) {
        egus[i]->plat    = plat;
        egus[i]->dppi    = &soc->dppi;
        egus[i]->irq_num = irqs[i];
        for (int n = 0; n < NRF54L_EGU_NUM_CHANNELS; n++)
            egus[i]->sub_channel[n] = -1;
        arm_register_io(&plat->cpu, bases[i], NRF54L_EGU_SIZE,
                        nrf54l_egu_read, nrf54l_egu_write, egus[i]);
    }

    /* TIMER10/20 — used by nrf_802154 lptimer backend (TIMER20). */
    nrf54l_timer_setup(&soc->timer10, plat, &soc->dppi,
                       NRF54L_TIMER10_BASE, NRF54L_TIMER10_IRQ, 0);
    nrf54l_timer_setup(&soc->timer20, plat, &soc->dppi,
                       NRF54L_TIMER20_BASE, NRF54L_TIMER20_IRQ, 1);
}

static void nrf54l15_soc_destroy(arm_platform_t *plat) {
    nrf54l15_soc_t *soc = (nrf54l15_soc_t *)plat->soc;
    if (soc) {
        /* Cancel + free any armed GRTC CC events. */
        for (int i = 0; i < NRF54L_GRTC_NUM_CC; i++) {
            if (soc->grtc.cc[i].event) {
                arm_cancel_event(&plat->cpu,
                                  (arm_event_t *)soc->grtc.cc[i].event);
                free(soc->grtc.cc[i].event);
                soc->grtc.cc[i].event = NULL;
            }
        }
        /* Free any remaining DPPI subscriber linked-list nodes. */
        for (int i = 0; i < NRF54L_DPPI_NUM_CHANNELS; i++) {
            nrf54l_dppi_subscriber_t *s = soc->dppi.subs[i];
            while (s) {
                nrf54l_dppi_subscriber_t *next = s->next;
                free(s);
                s = next;
            }
        }
        free(soc);
        plat->soc = NULL;
    }
}

static void nrf54l15_soc_set_console(arm_platform_t *plat,
                                      arm_uart_tx_callback cb, void *user_data) {
    nrf54l15_soc_t *soc = (nrf54l15_soc_t *)plat->soc;
    soc->uarte20.tx_cb   = cb;
    soc->uarte20.tx_user = user_data;
}

const arm_soc_ops_t nrf54l15_soc_ops = {
    .name        = "nrf54l15",
    .init        = nrf54l15_soc_init,
    .destroy     = nrf54l15_soc_destroy,
    .set_console = nrf54l15_soc_set_console,
};
